MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c532xx.h
/* *************************************  Bit definition for ADC_JDR register  ************************************** */
#define ADC_JDR_JDATA_Pos        (0U)
#define ADC_JDR_JDATA_Msk        (0xFFFFFFFFUL << ADC_JDR_JDATA_Pos)   /*!< 0xFFFFFFFF */
#define ADC_JDR_JDATA            ADC_JDR_JDATA_Msk                     /*!< Injected data */
#define ADC_JDR_JDATA_0          (0x1UL << ADC_JDR_JDATA_Pos)          /*!< 0x00000001 */
#define ADC_JDR_JDATA_1          (0x2UL << ADC_JDR_JDATA_Pos)          /*!< 0x00000002 */
#define ADC_JDR_JDATA_2          (0x4UL << ADC_JDR_JDATA_Pos)          /*!< 0x00000004 */
#define ADC_JDR_JDATA_3          (0x8UL << ADC_JDR_JDATA_Pos)          /*!< 0x00000008 */
#define ADC_JDR_JDATA_4          (0x10UL << ADC_JDR_JDATA_Pos)         /*!< 0x00000010 */
#define ADC_JDR_JDATA_5          (0x20UL << ADC_JDR_JDATA_Pos)         /*!< 0x00000020 */
#define ADC_JDR_JDATA_6          (0x40UL << ADC_JDR_JDATA_Pos)         /*!< 0x00000040 */
#define ADC_JDR_JDATA_7          (0x80UL << ADC_JDR_JDATA_Pos)         /*!< 0x00000080 */
#define ADC_JDR_JDATA_8          (0x100UL << ADC_JDR_JDATA_Pos)        /*!< 0x00000100 */
#define ADC_JDR_JDATA_9          (0x200UL << ADC_JDR_JDATA_Pos)        /*!< 0x00000200 */
#define ADC_JDR_JDATA_10         (0x400UL << ADC_JDR_JDATA_Pos)        /*!< 0x00000400 */
#define ADC_JDR_JDATA_11         (0x800UL << ADC_JDR_JDATA_Pos)        /*!< 0x00000800 */
#define ADC_JDR_JDATA_12         (0x1000UL << ADC_JDR_JDATA_Pos)       /*!< 0x00001000 */
#define ADC_JDR_JDATA_13         (0x2000UL << ADC_JDR_JDATA_Pos)       /*!< 0x00002000 */
#define ADC_JDR_JDATA_14         (0x4000UL << ADC_JDR_JDATA_Pos)       /*!< 0x00004000 */
#define ADC_JDR_JDATA_15         (0x8000UL << ADC_JDR_JDATA_Pos)       /*!< 0x00008000 */
#define ADC_JDR_JDATA_16         (0x10000UL << ADC_JDR_JDATA_Pos)      /*!< 0x00010000 */
#define ADC_JDR_JDATA_17         (0x20000UL << ADC_JDR_JDATA_Pos)      /*!< 0x00020000 */
#define ADC_JDR_JDATA_18         (0x40000UL << ADC_JDR_JDATA_Pos)      /*!< 0x00040000 */
#define ADC_JDR_JDATA_19         (0x80000UL << ADC_JDR_JDATA_Pos)      /*!< 0x00080000 */
#define ADC_JDR_JDATA_20         (0x100000UL << ADC_JDR_JDATA_Pos)     /*!< 0x00100000 */
#define ADC_JDR_JDATA_21         (0x200000UL << ADC_JDR_JDATA_Pos)     /*!< 0x00200000 */
#define ADC_JDR_JDATA_22         (0x400000UL << ADC_JDR_JDATA_Pos)     /*!< 0x00400000 */
#define ADC_JDR_JDATA_23         (0x800000UL << ADC_JDR_JDATA_Pos)     /*!< 0x00800000 */
#define ADC_JDR_JDATA_24         (0x1000000UL << ADC_JDR_JDATA_Pos)    /*!< 0x01000000 */
#define ADC_JDR_JDATA_25         (0x2000000UL << ADC_JDR_JDATA_Pos)    /*!< 0x02000000 */
#define ADC_JDR_JDATA_26         (0x4000000UL << ADC_JDR_JDATA_Pos)    /*!< 0x04000000 */
#define ADC_JDR_JDATA_27         (0x8000000UL << ADC_JDR_JDATA_Pos)    /*!< 0x08000000 */
#define ADC_JDR_JDATA_28         (0x10000000UL << ADC_JDR_JDATA_Pos)   /*!< 0x10000000 */
#define ADC_JDR_JDATA_29         (0x20000000UL << ADC_JDR_JDATA_Pos)   /*!< 0x20000000 */
#define ADC_JDR_JDATA_30         (0x40000000UL << ADC_JDR_JDATA_Pos)   /*!< 0x40000000 */
#define ADC_JDR_JDATA_31         (0x80000000UL << ADC_JDR_JDATA_Pos)   /*!< 0x80000000 */

/* ************************************  Bit definition for ADC_AWD2CR register  ************************************ */
#define ADC_AWD2CR_AWDCH_Pos     (0U)
#define ADC_AWD2CR_AWDCH_Msk     (0x3FFFUL << ADC_AWD2CR_AWDCH_Pos)    /*!< 0x00003FFF */
#define ADC_AWD2CR_AWDCH         ADC_AWD2CR_AWDCH_Msk                  /*!< Analog watchdog 2 channel selection */
#define ADC_AWD2CR_AWDCH_0       (0x1UL << ADC_AWD2CR_AWDCH_Pos)       /*!< 0x00000001 */
#define ADC_AWD2CR_AWDCH_1       (0x2UL << ADC_AWD2CR_AWDCH_Pos)       /*!< 0x00000002 */
#define ADC_AWD2CR_AWDCH_2       (0x4UL << ADC_AWD2CR_AWDCH_Pos)       /*!< 0x00000004 */
#define ADC_AWD2CR_AWDCH_3       (0x8UL << ADC_AWD2CR_AWDCH_Pos)       /*!< 0x00000008 */
#define ADC_AWD2CR_AWDCH_4       (0x10UL << ADC_AWD2CR_AWDCH_Pos)      /*!< 0x00000010 */
#define ADC_AWD2CR_AWDCH_5       (0x20UL << ADC_AWD2CR_AWDCH_Pos)      /*!< 0x00000020 */
#define ADC_AWD2CR_AWDCH_6       (0x40UL << ADC_AWD2CR_AWDCH_Pos)      /*!< 0x00000040 */
#define ADC_AWD2CR_AWDCH_7       (0x80UL << ADC_AWD2CR_AWDCH_Pos)      /*!< 0x00000080 */
#define ADC_AWD2CR_AWDCH_8       (0x100UL << ADC_AWD2CR_AWDCH_Pos)     /*!< 0x00000100 */
#define ADC_AWD2CR_AWDCH_9       (0x200UL << ADC_AWD2CR_AWDCH_Pos)     /*!< 0x00000200 */
#define ADC_AWD2CR_AWDCH_10      (0x400UL << ADC_AWD2CR_AWDCH_Pos)     /*!< 0x00000400 */
#define ADC_AWD2CR_AWDCH_11      (0x800UL << ADC_AWD2CR_AWDCH_Pos)     /*!< 0x00000800 */
#define ADC_AWD2CR_AWDCH_12      (0x1000UL << ADC_AWD2CR_AWDCH_Pos)    /*!< 0x00001000 */
#define ADC_AWD2CR_AWDCH_13      (0x2000UL << ADC_AWD2CR_AWDCH_Pos)    /*!< 0x00002000 */

/* ************************************  Bit definition for ADC_AWD3CR register  ************************************ */
#define ADC_AWD3CR_AWDCH_Pos     (0U)
#define ADC_AWD3CR_AWDCH_Msk     (0x3FFFUL << ADC_AWD3CR_AWDCH_Pos)    /*!< 0x00003FFF */
#define ADC_AWD3CR_AWDCH         ADC_AWD3CR_AWDCH_Msk                  /*!< Analog watchdog 3 channel selection */
#define ADC_AWD3CR_AWDCH_0       (0x1UL << ADC_AWD3CR_AWDCH_Pos)       /*!< 0x00000001 */
#define ADC_AWD3CR_AWDCH_1       (0x2UL << ADC_AWD3CR_AWDCH_Pos)       /*!< 0x00000002 */
#define ADC_AWD3CR_AWDCH_2       (0x4UL << ADC_AWD3CR_AWDCH_Pos)       /*!< 0x00000004 */
#define ADC_AWD3CR_AWDCH_3       (0x8UL << ADC_AWD3CR_AWDCH_Pos)       /*!< 0x00000008 */
#define ADC_AWD3CR_AWDCH_4       (0x10UL << ADC_AWD3CR_AWDCH_Pos)      /*!< 0x00000010 */
#define ADC_AWD3CR_AWDCH_5       (0x20UL << ADC_AWD3CR_AWDCH_Pos)      /*!< 0x00000020 */
#define ADC_AWD3CR_AWDCH_6       (0x40UL << ADC_AWD3CR_AWDCH_Pos)      /*!< 0x00000040 */
#define ADC_AWD3CR_AWDCH_7       (0x80UL << ADC_AWD3CR_AWDCH_Pos)      /*!< 0x00000080 */
#define ADC_AWD3CR_AWDCH_8       (0x100UL << ADC_AWD3CR_AWDCH_Pos)     /*!< 0x00000100 */
#define ADC_AWD3CR_AWDCH_9       (0x200UL << ADC_AWD3CR_AWDCH_Pos)     /*!< 0x00000200 */
#define ADC_AWD3CR_AWDCH_10      (0x400UL << ADC_AWD3CR_AWDCH_Pos)     /*!< 0x00000400 */
#define ADC_AWD3CR_AWDCH_11      (0x800UL << ADC_AWD3CR_AWDCH_Pos)     /*!< 0x00000800 */
#define ADC_AWD3CR_AWDCH_12      (0x1000UL << ADC_AWD3CR_AWDCH_Pos)    /*!< 0x00001000 */
#define ADC_AWD3CR_AWDCH_13      (0x2000UL << ADC_AWD3CR_AWDCH_Pos)    /*!< 0x00002000 */

/* ***********************************  Bit definition for ADC_AWD1LTR register  ************************************ */
#define ADC_AWD1LTR_LTR_Pos      (0U)
#define ADC_AWD1LTR_LTR_Msk      (0x7FFFFFUL << ADC_AWD1LTR_LTR_Pos)   /*!< 0x007FFFFF */
#define ADC_AWD1LTR_LTR          ADC_AWD1LTR_LTR_Msk                   /*!< Analog watchdog 1 lower threshold */
#define ADC_AWD1LTR_LTR_0        (0x1UL << ADC_AWD1LTR_LTR_Pos)        /*!< 0x00000001 */
#define ADC_AWD1LTR_LTR_1        (0x2UL << ADC_AWD1LTR_LTR_Pos)        /*!< 0x00000002 */
#define ADC_AWD1LTR_LTR_2        (0x4UL << ADC_AWD1LTR_LTR_Pos)        /*!< 0x00000004 */
#define ADC_AWD1LTR_LTR_3        (0x8UL << ADC_AWD1LTR_LTR_Pos)        /*!< 0x00000008 */
#define ADC_AWD1LTR_LTR_4        (0x10UL << ADC_AWD1LTR_LTR_Pos)       /*!< 0x00000010 */
#define ADC_AWD1LTR_LTR_5        (0x20UL << ADC_AWD1LTR_LTR_Pos)       /*!< 0x00000020 */
#define ADC_AWD1LTR_LTR_6        (0x40UL << ADC_AWD1LTR_LTR_Pos)       /*!< 0x00000040 */
#define ADC_AWD1LTR_LTR_7        (0x80UL << ADC_AWD1LTR_LTR_Pos)       /*!< 0x00000080 */
#define ADC_AWD1LTR_LTR_8        (0x100UL << ADC_AWD1LTR_LTR_Pos)      /*!< 0x00000100 */
#define ADC_AWD1LTR_LTR_9        (0x200UL << ADC_AWD1LTR_LTR_Pos)      /*!< 0x00000200 */
#define ADC_AWD1LTR_LTR_10       (0x400UL << ADC_AWD1LTR_LTR_Pos)      /*!< 0x00000400 */
#define ADC_AWD1LTR_LTR_11       (0x800UL << ADC_AWD1LTR_LTR_Pos)      /*!< 0x00000800 */
#define ADC_AWD1LTR_LTR_12       (0x1000UL << ADC_AWD1LTR_LTR_Pos)     /*!< 0x00001000 */
#define ADC_AWD1LTR_LTR_13       (0x2000UL << ADC_AWD1LTR_LTR_Pos)     /*!< 0x00002000 */
#define ADC_AWD1LTR_LTR_14       (0x4000UL << ADC_AWD1LTR_LTR_Pos)     /*!< 0x00004000 */
#define ADC_AWD1LTR_LTR_15       (0x8000UL << ADC_AWD1LTR_LTR_Pos)     /*!< 0x00008000 */
#define ADC_AWD1LTR_LTR_16       (0x10000UL << ADC_AWD1LTR_LTR_Pos)    /*!< 0x00010000 */
#define ADC_AWD1LTR_LTR_17       (0x20000UL << ADC_AWD1LTR_LTR_Pos)    /*!< 0x00020000 */
#define ADC_AWD1LTR_LTR_18       (0x40000UL << ADC_AWD1LTR_LTR_Pos)    /*!< 0x00040000 */
#define ADC_AWD1LTR_LTR_19       (0x80000UL << ADC_AWD1LTR_LTR_Pos)    /*!< 0x00080000 */
#define ADC_AWD1LTR_LTR_20       (0x100000UL << ADC_AWD1LTR_LTR_Pos)   /*!< 0x00100000 */
#define ADC_AWD1LTR_LTR_21       (0x200000UL << ADC_AWD1LTR_LTR_Pos)   /*!< 0x00200000 */
#define ADC_AWD1LTR_LTR_22       (0x400000UL << ADC_AWD1LTR_LTR_Pos)   /*!< 0x00400000 */

