MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c532xx.h
/* ************************************  Bit definition for DBGMCU_CR register  ************************************* */
#define DBGMCU_CR_DBG_SLEEP_Pos                (0U)
#define DBGMCU_CR_DBG_SLEEP_Msk                (0x1UL << DBGMCU_CR_DBG_SLEEP_Pos)                  /*!< 0x00000001 */
#define DBGMCU_CR_DBG_SLEEP                    DBGMCU_CR_DBG_SLEEP_Msk                             /*!< Debug in Sleep
                                                                                                        mode */
#define DBGMCU_CR_DBG_STOP_Pos                 (1U)
#define DBGMCU_CR_DBG_STOP_Msk                 (0x1UL << DBGMCU_CR_DBG_STOP_Pos)                   /*!< 0x00000002 */
#define DBGMCU_CR_DBG_STOP                     DBGMCU_CR_DBG_STOP_Msk                              /*!< Debug in Stop
                                                                                                        mode */
#define DBGMCU_CR_DBG_STANDBY_Pos              (2U)
#define DBGMCU_CR_DBG_STANDBY_Msk              (0x1UL << DBGMCU_CR_DBG_STANDBY_Pos)                /*!< 0x00000004 */
#define DBGMCU_CR_DBG_STANDBY                  DBGMCU_CR_DBG_STANDBY_Msk                           /*!< Debug in Standby
                                                                                                        mode */
#define DBGMCU_CR_TRACE_IOEN_Pos               (4U)
#define DBGMCU_CR_TRACE_IOEN_Msk               (0x1UL << DBGMCU_CR_TRACE_IOEN_Pos)                 /*!< 0x00000010 */
#define DBGMCU_CR_TRACE_IOEN                   DBGMCU_CR_TRACE_IOEN_Msk                            /*!< Trace pin enable
                                                                                                        */
#define DBGMCU_CR_TRACE_EN_Pos                 (5U)
#define DBGMCU_CR_TRACE_EN_Msk                 (0x1UL << DBGMCU_CR_TRACE_EN_Pos)                   /*!< 0x00000020 */
#define DBGMCU_CR_TRACE_EN                     DBGMCU_CR_TRACE_EN_Msk                              /*!< Trace port and
                                                                                                        clock enable. */
#define DBGMCU_CR_TRACE_MODE_Pos               (6U)
#define DBGMCU_CR_TRACE_MODE_Msk               (0x3UL << DBGMCU_CR_TRACE_MODE_Pos)                 /*!< 0x000000C0 */
#define DBGMCU_CR_TRACE_MODE                   DBGMCU_CR_TRACE_MODE_Msk                            /*!< Trace pin
                                                                                                        assignment */
#define DBGMCU_CR_TRACE_MODE_0                (0x1UL << DBGMCU_CR_TRACE_MODE_Pos)                  /*!< 0x00000040 */
#define DBGMCU_CR_TRACE_MODE_1                (0x2UL << DBGMCU_CR_TRACE_MODE_Pos)                  /*!< 0x00000080 */

/* *********************************  Bit definition for DBGMCU_APB1LFZR register  ********************************** */
#define DBGMCU_APB1LFZR_DBG_TIM2_STOP_Pos      (0U)
#define DBGMCU_APB1LFZR_DBG_TIM2_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_TIM2_STOP_Pos)        /*!< 0x00000001 */
#define DBGMCU_APB1LFZR_DBG_TIM2_STOP          DBGMCU_APB1LFZR_DBG_TIM2_STOP_Msk                   /*!< TIM2 stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_TIM6_STOP_Pos      (4U)
#define DBGMCU_APB1LFZR_DBG_TIM6_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_TIM6_STOP_Pos)        /*!< 0x00000010 */
#define DBGMCU_APB1LFZR_DBG_TIM6_STOP          DBGMCU_APB1LFZR_DBG_TIM6_STOP_Msk                   /*!< TIM6 stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_TIM7_STOP_Pos      (5U)
#define DBGMCU_APB1LFZR_DBG_TIM7_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_TIM7_STOP_Pos)        /*!< 0x00000020 */
#define DBGMCU_APB1LFZR_DBG_TIM7_STOP          DBGMCU_APB1LFZR_DBG_TIM7_STOP_Msk                   /*!< TIM7 stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_TIM12_STOP_Pos     (6U)
#define DBGMCU_APB1LFZR_DBG_TIM12_STOP_Msk     (0x1UL << DBGMCU_APB1LFZR_DBG_TIM12_STOP_Pos)       /*!< 0x00000040 */
#define DBGMCU_APB1LFZR_DBG_TIM12_STOP         DBGMCU_APB1LFZR_DBG_TIM12_STOP_Msk                  /*!< TIM12 stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_WWDG_STOP_Pos      (11U)
#define DBGMCU_APB1LFZR_DBG_WWDG_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_WWDG_STOP_Pos)        /*!< 0x00000800 */
#define DBGMCU_APB1LFZR_DBG_WWDG_STOP          DBGMCU_APB1LFZR_DBG_WWDG_STOP_Msk                   /*!< WWDG stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_IWDG_STOP_Pos      (12U)
#define DBGMCU_APB1LFZR_DBG_IWDG_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_IWDG_STOP_Pos)        /*!< 0x00001000 */
#define DBGMCU_APB1LFZR_DBG_IWDG_STOP          DBGMCU_APB1LFZR_DBG_IWDG_STOP_Msk                   /*!< IWDG stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_I2C1_STOP_Pos      (21U)
#define DBGMCU_APB1LFZR_DBG_I2C1_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_I2C1_STOP_Pos)        /*!< 0x00200000 */
#define DBGMCU_APB1LFZR_DBG_I2C1_STOP          DBGMCU_APB1LFZR_DBG_I2C1_STOP_Msk                   /*!< I2C1 SMBUS
                                                                                                        timeout stop in
                                                                                                        debug */
#define DBGMCU_APB1LFZR_DBG_I3C1_STOP_Pos      (23U)
#define DBGMCU_APB1LFZR_DBG_I3C1_STOP_Msk      (0x1UL << DBGMCU_APB1LFZR_DBG_I3C1_STOP_Pos)        /*!< 0x00800000 */
#define DBGMCU_APB1LFZR_DBG_I3C1_STOP          DBGMCU_APB1LFZR_DBG_I3C1_STOP_Msk                   /*!< I3C1 SCL stall
                                                                                                        counter stop in
                                                                                                        debug */

/* **********************************  Bit definition for DBGMCU_APB2FZR register  ********************************** */
#define DBGMCU_APB2FZR_DBG_TIM1_STOP_Pos       (11U)
#define DBGMCU_APB2FZR_DBG_TIM1_STOP_Msk       (0x1UL << DBGMCU_APB2FZR_DBG_TIM1_STOP_Pos)         /*!< 0x00000800 */
#define DBGMCU_APB2FZR_DBG_TIM1_STOP           DBGMCU_APB2FZR_DBG_TIM1_STOP_Msk                    /*!< TIM1 stop in
                                                                                                        debug */
#define DBGMCU_APB2FZR_DBG_TIM8_STOP_Pos       (13U)
#define DBGMCU_APB2FZR_DBG_TIM8_STOP_Msk       (0x1UL << DBGMCU_APB2FZR_DBG_TIM8_STOP_Pos)         /*!< 0x00002000 */
#define DBGMCU_APB2FZR_DBG_TIM8_STOP           DBGMCU_APB2FZR_DBG_TIM8_STOP_Msk                    /*!< TIM8 stop in
                                                                                                        debug */
#define DBGMCU_APB2FZR_DBG_TIM15_STOP_Pos      (16U)
#define DBGMCU_APB2FZR_DBG_TIM15_STOP_Msk      (0x1UL << DBGMCU_APB2FZR_DBG_TIM15_STOP_Pos)        /*!< 0x00010000 */
#define DBGMCU_APB2FZR_DBG_TIM15_STOP          DBGMCU_APB2FZR_DBG_TIM15_STOP_Msk                   /*!< TIM15 stop in
                                                                                                        debug */

/* **********************************  Bit definition for DBGMCU_APB3FZR register  ********************************** */
#define DBGMCU_APB3FZR_DBG_LPTIM1_STOP_Pos     (17U)
#define DBGMCU_APB3FZR_DBG_LPTIM1_STOP_Msk     (0x1UL << DBGMCU_APB3FZR_DBG_LPTIM1_STOP_Pos)       /*!< 0x00020000 */
#define DBGMCU_APB3FZR_DBG_LPTIM1_STOP         DBGMCU_APB3FZR_DBG_LPTIM1_STOP_Msk                  /*!< LPTIM1 stop
                                                                                                        in debug */
#define DBGMCU_APB3FZR_DBG_RTC_STOP_Pos        (30U)
#define DBGMCU_APB3FZR_DBG_RTC_STOP_Msk        (0x1UL << DBGMCU_APB3FZR_DBG_RTC_STOP_Pos)          /*!< 0x40000000 */
#define DBGMCU_APB3FZR_DBG_RTC_STOP            DBGMCU_APB3FZR_DBG_RTC_STOP_Msk                     /*!< RTC stop in
                                                                                                        debug */

/* **********************************  Bit definition for DBGMCU_AHB1FZR register  ********************************** */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_0_STOP_Pos   (0U)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_0_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_0_STOP_Pos)     /*!< 0x00000001 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_0_STOP       DBGMCU_AHB1FZR_DBG_LPDMA1_0_STOP_Msk                /*!< LPDMA1 channel 0
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_1_STOP_Pos   (1U)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_1_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_1_STOP_Pos)     /*!< 0x00000002 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_1_STOP       DBGMCU_AHB1FZR_DBG_LPDMA1_1_STOP_Msk                /*!< LPDMA1 channel 1
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_2_STOP_Pos   (2U)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_2_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_2_STOP_Pos)     /*!< 0x00000004 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_2_STOP       DBGMCU_AHB1FZR_DBG_LPDMA1_2_STOP_Msk                /*!< LPDMA1 channel 2
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_3_STOP_Pos   (3U)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_3_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_3_STOP_Pos)     /*!< 0x00000008 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_3_STOP       DBGMCU_AHB1FZR_DBG_LPDMA1_3_STOP_Msk                /*!< LPDMA1 channel 3
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_0_STOP_Pos   (16U)
#define DBGMCU_AHB1FZR_DBG_LPDMA2_0_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA2_0_STOP_Pos)     /*!< 0x00010000 */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_0_STOP       DBGMCU_AHB1FZR_DBG_LPDMA2_0_STOP_Msk                /*!< LPDMA2 channel 0
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_1_STOP_Pos   (17U)
#define DBGMCU_AHB1FZR_DBG_LPDMA2_1_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA2_1_STOP_Pos)     /*!< 0x00020000 */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_1_STOP       DBGMCU_AHB1FZR_DBG_LPDMA2_1_STOP_Msk                /*!< LPDMA2 channel 1
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_2_STOP_Pos   (18U)
#define DBGMCU_AHB1FZR_DBG_LPDMA2_2_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA2_2_STOP_Pos)     /*!< 0x00040000 */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_2_STOP       DBGMCU_AHB1FZR_DBG_LPDMA2_2_STOP_Msk                /*!< LPDMA2 channel 2
                                                                                                        stop in debug */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_3_STOP_Pos   (19U)
#define DBGMCU_AHB1FZR_DBG_LPDMA2_3_STOP_Msk   (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA2_3_STOP_Pos)     /*!< 0x00080000 */
#define DBGMCU_AHB1FZR_DBG_LPDMA2_3_STOP       DBGMCU_AHB1FZR_DBG_LPDMA2_3_STOP_Msk                /*!< LPDMA2 channel 3
                                                                                                        stop in debug */

