MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c532xx.h
/* ************************************  Bit definition for DBGMCU_SR register  ************************************* */
#define DBGMCU_SR_AP_PRESENT_Pos               (0U)
#define DBGMCU_SR_AP_PRESENT_Msk               (0xFFFFUL << DBGMCU_SR_AP_PRESENT_Pos)              /*!< 0x0000FFFF */
#define DBGMCU_SR_AP_PRESENT                   DBGMCU_SR_AP_PRESENT_Msk                            /*!< Access port
                                                                                                        present */
#define DBGMCU_SR_AP_ENABLED_Pos               (16U)
#define DBGMCU_SR_AP_ENABLED_Msk               (0xFFFFUL << DBGMCU_SR_AP_ENABLED_Pos)              /*!< 0xFFFF0000 */
#define DBGMCU_SR_AP_ENABLED                   DBGMCU_SR_AP_ENABLED_Msk                            /*!< Access port
                                                                                                        enable */

/* *******************************  Bit definition for DBGMCU_DBG_AUTH_HOST register  ******************************* */
#define DBGMCU_DBG_AUTH_HOST_AUTH_KEY_Pos      (0U)
#define DBGMCU_DBG_AUTH_HOST_AUTH_KEY_Msk      (0xFFFFFFFFUL << DBGMCU_DBG_AUTH_HOST_AUTH_KEY_Pos) /*!< 0xFFFFFFFF */
#define DBGMCU_DBG_AUTH_HOST_AUTH_KEY          DBGMCU_DBG_AUTH_HOST_AUTH_KEY_Msk                   /*!< Device
                                                                                                        authentication
                                                                                                        key */

/* ******************************  Bit definition for DBGMCU_DBG_AUTH_DEVICE register  ****************************** */
#define DBGMCU_DBG_AUTH_DEVICE_AUTH_ID_Pos     (0U)
#define DBGMCU_DBG_AUTH_DEVICE_AUTH_ID_Msk     (0xFFFFFFFFUL << \
                                               DBGMCU_DBG_AUTH_DEVICE_AUTH_ID_Pos)                 /*!< 0xFFFFFFFF */
#define DBGMCU_DBG_AUTH_DEVICE_AUTH_ID         DBGMCU_DBG_AUTH_DEVICE_AUTH_ID_Msk                  /*!< Device specific
                                                                                                        ID */

/* *******************************  Bit definition for DBGMCU_DBG_BSKEY_PWD register  ******************************* */
#define DBGMCU_DBG_BSKEY_PWD_DBG_BSKEY_PWD_Pos (0U)
#define DBGMCU_DBG_BSKEY_PWD_DBG_BSKEY_PWD_Msk (0xFFFFFFFFUL << \
                                               DBGMCU_DBG_BSKEY_PWD_DBG_BSKEY_PWD_Pos)             /*!< 0xFFFFFFFF */
#define DBGMCU_DBG_BSKEY_PWD_DBG_BSKEY_PWD     DBGMCU_DBG_BSKEY_PWD_DBG_BSKEY_PWD_Msk              /*!< Boundary-scan
                                                                                                        key (BS key) */

/* *********************************  Bit definition for DBGMCU_DBG_VALR register  ********************************** */
#define DBGMCU_DBG_VALR_VAL_RDY_Pos            (0U)
#define DBGMCU_DBG_VALR_VAL_RDY_Msk            (0x1UL << DBGMCU_DBG_VALR_VAL_RDY_Pos)              /*!< 0x00000001 */
#define DBGMCU_DBG_VALR_VAL_RDY                DBGMCU_DBG_VALR_VAL_RDY_Msk                         /*!< Validation ready
                                                                                                        */
#define DBGMCU_DBG_VALR_VAL_OEMKEY_Pos         (1U)
#define DBGMCU_DBG_VALR_VAL_OEMKEY_Msk         (0x1UL << DBGMCU_DBG_VALR_VAL_OEMKEY_Pos)           /*!< 0x00000002 */
#define DBGMCU_DBG_VALR_VAL_OEMKEY             DBGMCU_DBG_VALR_VAL_OEMKEY_Msk                      /*!< OEMKEY
                                                                                                        validation. */

/* ***********************************  Bit definition for DBGMCU_PIDR4 register  *********************************** */
#define DBGMCU_PIDR4_JEP106CON_Pos             (0U)
#define DBGMCU_PIDR4_JEP106CON_Msk             (0xFUL << DBGMCU_PIDR4_JEP106CON_Pos)               /*!< 0x0000000F */
#define DBGMCU_PIDR4_JEP106CON                 DBGMCU_PIDR4_JEP106CON_Msk                          /*!< JEP106
                                                                                                        continuation
                                                                                                        code */
#define DBGMCU_PIDR4_SIZE_Pos                  (4U)
#define DBGMCU_PIDR4_SIZE_Msk                  (0xFUL << DBGMCU_PIDR4_SIZE_Pos)                    /*!< 0x000000F0 */
#define DBGMCU_PIDR4_SIZE                      DBGMCU_PIDR4_SIZE_Msk                               /*!< Register file
                                                                                                        size */

/* ***********************************  Bit definition for DBGMCU_PIDR0 register  *********************************** */
#define DBGMCU_PIDR0_PARTNUM_Pos               (0U)
#define DBGMCU_PIDR0_PARTNUM_Msk               (0xFFUL << DBGMCU_PIDR0_PARTNUM_Pos)                /*!< 0x000000FF */
#define DBGMCU_PIDR0_PARTNUM                   DBGMCU_PIDR0_PARTNUM_Msk                            /*!< Part number bits
                                                                                                        [7:0] */

/* ***********************************  Bit definition for DBGMCU_PIDR1 register  *********************************** */
#define DBGMCU_PIDR1_PARTNUM_Pos               (0U)
#define DBGMCU_PIDR1_PARTNUM_Msk               (0xFUL << DBGMCU_PIDR1_PARTNUM_Pos)                 /*!< 0x0000000F */
#define DBGMCU_PIDR1_PARTNUM                   DBGMCU_PIDR1_PARTNUM_Msk                            /*!< Part number bits
                                                                                                        [11:8] */
#define DBGMCU_PIDR1_JEP106ID_Pos              (4U)
#define DBGMCU_PIDR1_JEP106ID_Msk              (0xFUL << DBGMCU_PIDR1_JEP106ID_Pos)                /*!< 0x000000F0 */
#define DBGMCU_PIDR1_JEP106ID                  DBGMCU_PIDR1_JEP106ID_Msk                           /*!< JEP106 identity
                                                                                                        code bits [3:0]
                                                                                                        */

