MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c532xx.h
/******************  Bit definition for I3C_DEVRX register  *******************/
#define I3C_DEVRX_DA_Pos                (1U)
#define I3C_DEVRX_DA_Msk                (0x7FUL << I3C_DEVRX_DA_Pos)            /*!< 0x000000FE */
#define I3C_DEVRX_DA                    I3C_DEVRX_DA_Msk                        /*!< Dynamic Address Target x */
#define I3C_DEVRX_IBIACK_Pos            (16U)
#define I3C_DEVRX_IBIACK_Msk            (0x1UL << I3C_DEVRX_IBIACK_Pos)         /*!< 0x00010000 */
#define I3C_DEVRX_IBIACK                I3C_DEVRX_IBIACK_Msk                    /*!< IBI Acknowledge from Target x */
#define I3C_DEVRX_CRACK_Pos             (17U)
#define I3C_DEVRX_CRACK_Msk             (0x1UL << I3C_DEVRX_CRACK_Pos)          /*!< 0x00020000 */
#define I3C_DEVRX_CRACK                 I3C_DEVRX_CRACK_Msk                     /*!< Controller-role Acknowledge from Target x */
#define I3C_DEVRX_IBIDEN_Pos            (18U)
#define I3C_DEVRX_IBIDEN_Msk            (0x1UL << I3C_DEVRX_IBIDEN_Pos)         /*!< 0x00040000 */
#define I3C_DEVRX_IBIDEN                I3C_DEVRX_IBIDEN_Msk                    /*!< IBI Additional Data Enable */
#define I3C_DEVRX_SUSP_Pos              (19U)
#define I3C_DEVRX_SUSP_Msk              (0x1UL << I3C_DEVRX_SUSP_Pos)           /*!< 0x00080000 */
#define I3C_DEVRX_SUSP                  I3C_DEVRX_SUSP_Msk                      /*!< Suspended Transfer */
#define I3C_DEVRX_DIS_Pos               (31U)
#define I3C_DEVRX_DIS_Msk               (0x1UL << I3C_DEVRX_DIS_Pos)            /*!< 0x80000000 */
#define I3C_DEVRX_DIS                   I3C_DEVRX_DIS_Msk                       /*!< Disable Register access */

/******************  Bit definition for I3C_MAXRLR register  ******************/
#define I3C_MAXRLR_MRL_Pos              (0U)
#define I3C_MAXRLR_MRL_Msk              (0xFFFFUL << I3C_MAXRLR_MRL_Pos)        /*!< 0x0000FFFF */
#define I3C_MAXRLR_MRL                  I3C_MAXRLR_MRL_Msk                      /*!< Maximum Read Length */
#define I3C_MAXRLR_IBIP_Pos             (16U)
#define I3C_MAXRLR_IBIP_Msk             (0x7UL << I3C_MAXRLR_IBIP_Pos)          /*!< 0x00070000 */
#define I3C_MAXRLR_IBIP                 I3C_MAXRLR_IBIP_Msk                     /*!< IBI Payload size */
#define I3C_MAXRLR_IBIP_0               (0x1UL << I3C_MAXRLR_IBIP_Pos)          /*!< 0x00010000 */
#define I3C_MAXRLR_IBIP_1               (0x2UL << I3C_MAXRLR_IBIP_Pos)          /*!< 0x00020000 */
#define I3C_MAXRLR_IBIP_2               (0x4UL << I3C_MAXRLR_IBIP_Pos)          /*!< 0x00040000 */

/******************  Bit definition for I3C_MAXWLR register  ******************/
#define I3C_MAXWLR_MWL_Pos              (0U)
#define I3C_MAXWLR_MWL_Msk              (0xFFFFUL << I3C_MAXWLR_MWL_Pos)        /*!< 0x0000FFFF */
#define I3C_MAXWLR_MWL                  I3C_MAXWLR_MWL_Msk                      /*!< Maximum Write Length */

/****************  Bit definition for I3C_TIMINGR0 register  ******************/
#define I3C_TIMINGR0_SCLL_PP_Pos        (0U)
#define I3C_TIMINGR0_SCLL_PP_Msk        (0xFFUL << I3C_TIMINGR0_SCLL_PP_Pos)      /*!< 0x000000FF */
#define I3C_TIMINGR0_SCLL_PP            I3C_TIMINGR0_SCLL_PP_Msk                  /*!< SCL Low duration during I3C Push-Pull phases */
#define I3C_TIMINGR0_SCLH_I3C_Pos       (8U)
#define I3C_TIMINGR0_SCLH_I3C_Msk       (0xFFUL << I3C_TIMINGR0_SCLH_I3C_Pos)     /*!< 0x0000FF00 */
#define I3C_TIMINGR0_SCLH_I3C           I3C_TIMINGR0_SCLH_I3C_Msk                 /*!< SCL High duration during I3C Open-drain and Push-Pull phases */
#define I3C_TIMINGR0_SCLL_OD_Pos        (16U)
#define I3C_TIMINGR0_SCLL_OD_Msk        (0xFFUL << I3C_TIMINGR0_SCLL_OD_Pos)      /*!< 0x00FF0000 */
#define I3C_TIMINGR0_SCLL_OD            I3C_TIMINGR0_SCLL_OD_Msk                  /*!< SCL Low duration during  I3C Open-drain phases and I2C transfer */
#define I3C_TIMINGR0_SCLH_I2C_Pos       (24U)
#define I3C_TIMINGR0_SCLH_I2C_Msk       (0xFFUL << I3C_TIMINGR0_SCLH_I2C_Pos)     /*!< 0xFF000000 */
#define I3C_TIMINGR0_SCLH_I2C           I3C_TIMINGR0_SCLH_I2C_Msk                 /*!< SCL High duration during I2C transfer */

/****************  Bit definition for I3C_TIMINGR1 register  ******************/
#define I3C_TIMINGR1_AVAL_Pos           (0U)
#define I3C_TIMINGR1_AVAL_Msk           (0xFFUL << I3C_TIMINGR1_AVAL_Pos)         /*!< 0x000000FF */
#define I3C_TIMINGR1_AVAL               I3C_TIMINGR1_AVAL_Msk                     /*!< Timing for I3C Bus Idle or Available condition */
#define I3C_TIMINGR1_ASNCR_Pos          (8U)
#define I3C_TIMINGR1_ASNCR_Msk          (0x3UL << I3C_TIMINGR1_ASNCR_Pos)         /*!< 0x00000300 */
#define I3C_TIMINGR1_ASNCR              I3C_TIMINGR1_ASNCR_Msk                    /*!< Activity State of the New Controller */
#define I3C_TIMINGR1_ASNCR_0            (0x1UL << I3C_TIMINGR1_ASNCR_Pos)         /*!< 0x00000100 */
#define I3C_TIMINGR1_ASNCR_1            (0x2UL << I3C_TIMINGR1_ASNCR_Pos)         /*!< 0x00000200 */
#define I3C_TIMINGR1_FREE_Pos           (16U)
#define I3C_TIMINGR1_FREE_Msk           (0x7FUL << I3C_TIMINGR1_FREE_Pos)         /*!< 0x007F0000 */
#define I3C_TIMINGR1_FREE               I3C_TIMINGR1_FREE_Msk                     /*!< Timing for I3C Bus Free condition */
#define I3C_TIMINGR1_SDA_HD_Pos         (28U)
#define I3C_TIMINGR1_SDA_HD_Msk         (0x3UL << I3C_TIMINGR1_SDA_HD_Pos)        /*!< 0x30000000 */
#define I3C_TIMINGR1_SDA_HD             I3C_TIMINGR1_SDA_HD_Msk                   /*!< SDA Hold Duration */
#define I3C_TIMINGR1_SDA_HD_0           (0x1UL << I3C_TIMINGR1_SDA_HD_Pos)        /*!< 0x10000000 */
#define I3C_TIMINGR1_SDA_HD_1           (0x2UL << I3C_TIMINGR1_SDA_HD_Pos)        /*!< 0x20000000 */

/****************  Bit definition for I3C_TIMINGR2 register  ******************/
#define I3C_TIMINGR2_STALLT_Pos         (0U)
#define I3C_TIMINGR2_STALLT_Msk         (0x1UL << I3C_TIMINGR2_STALLT_Pos)        /*!< 0x00000001 */
#define I3C_TIMINGR2_STALLT             I3C_TIMINGR2_STALLT_Msk                   /*!< Stall on T bit */
#define I3C_TIMINGR2_STALLD_Pos         (1U)
#define I3C_TIMINGR2_STALLD_Msk         (0x1UL << I3C_TIMINGR2_STALLD_Pos)        /*!< 0x00000002 */
#define I3C_TIMINGR2_STALLD             I3C_TIMINGR2_STALLD_Msk                   /*!< Stall on PAR bit of data bytes */
#define I3C_TIMINGR2_STALLC_Pos         (2U)
#define I3C_TIMINGR2_STALLC_Msk         (0x1UL << I3C_TIMINGR2_STALLC_Pos)        /*!< 0x00000004 */
#define I3C_TIMINGR2_STALLC             I3C_TIMINGR2_STALLC_Msk                   /*!< Stall on PAR bit of CCC byte */
#define I3C_TIMINGR2_STALLA_Pos         (3U)
#define I3C_TIMINGR2_STALLA_Msk         (0x1UL << I3C_TIMINGR2_STALLA_Pos)        /*!< 0x00000008 */
#define I3C_TIMINGR2_STALLA             I3C_TIMINGR2_STALLA_Msk                   /*!< Stall on ACK bit */
#define I3C_TIMINGR2_STALLR_Pos         (4U)
#define I3C_TIMINGR2_STALLR_Msk         (0x1UL << I3C_TIMINGR2_STALLR_Pos)        /*!< 0x00000010 */
#define I3C_TIMINGR2_STALLR             I3C_TIMINGR2_STALLR_Msk                   /*!< Stall on I2C Read ACK bit */
#define I3C_TIMINGR2_STALLS_Pos         (5U)
#define I3C_TIMINGR2_STALLS_Msk         (0x1UL << I3C_TIMINGR2_STALLS_Pos)        /*!< 0x00000020 */
#define I3C_TIMINGR2_STALLS             I3C_TIMINGR2_STALLS_Msk                   /*!< Stall on I2C Write ACK bit */
#define I3C_TIMINGR2_STALLL_Pos         (6U)
#define I3C_TIMINGR2_STALLL_Msk         (0x1UL << I3C_TIMINGR2_STALLL_Pos)        /*!< 0x00000040 */
#define I3C_TIMINGR2_STALLL             I3C_TIMINGR2_STALLL_Msk                   /*!< Stall on I2C Address ACK bit */
#define I3C_TIMINGR2_STALL_Pos          (8U)
#define I3C_TIMINGR2_STALL_Msk          (0xFFUL << I3C_TIMINGR2_STALL_Pos)        /*!< 0x0000FF00 */
#define I3C_TIMINGR2_STALL              I3C_TIMINGR2_STALL_Msk                    /*!< Controller Stall duration */

/*******************  Bit definition for I3C_BCR register  ********************/
#define I3C_BCR_BCR_Pos                 (0U)
#define I3C_BCR_BCR_Msk                 (0xFFUL << I3C_BCR_BCR_Pos)               /*!< 0x000000FF */
#define I3C_BCR_BCR                     I3C_BCR_BCR_Msk                           /*!< Bus Characteristics */
#define I3C_BCR_BCR0_Pos                (0U)
#define I3C_BCR_BCR0_Msk                (0x1UL << I3C_BCR_BCR0_Pos)               /*!< 0x00000001 */
#define I3C_BCR_BCR0                    I3C_BCR_BCR0_Msk                          /*!< Max Data Speed Limitation */
#define I3C_BCR_BCR1_Pos                (1U)
#define I3C_BCR_BCR1_Msk                (0x1UL << I3C_BCR_BCR1_Pos)               /*!< 0x00000002 */
#define I3C_BCR_BCR1                    I3C_BCR_BCR1_Msk                          /*!< IBI Request capable */
#define I3C_BCR_BCR2_Pos                (2U)
#define I3C_BCR_BCR2_Msk                (0x1UL << I3C_BCR_BCR2_Pos)               /*!< 0x00000004 */
#define I3C_BCR_BCR2                    I3C_BCR_BCR2_Msk                          /*!< IBI Payload additional Mandatory Data Byte */
#define I3C_BCR_BCR3_Pos                (3U)
#define I3C_BCR_BCR3_Msk                (0x1UL << I3C_BCR_BCR3_Pos)               /*!< 0x00000008 */
#define I3C_BCR_BCR3                    I3C_BCR_BCR3_Msk                          /*!< Offline capable */
#define I3C_BCR_BCR4_Pos                (4U)
#define I3C_BCR_BCR4_Msk                (0x1UL << I3C_BCR_BCR4_Pos)               /*!< 0x00000010 */
#define I3C_BCR_BCR4                    I3C_BCR_BCR4_Msk                          /*!< Virtual target support */
#define I3C_BCR_BCR5_Pos                (5U)
#define I3C_BCR_BCR5_Msk                (0x1UL << I3C_BCR_BCR5_Pos)               /*!< 0x00000020 */
#define I3C_BCR_BCR5                    I3C_BCR_BCR5_Msk                          /*!< Advanced capabilities */
#define I3C_BCR_BCR6_Pos                (6U)
#define I3C_BCR_BCR6_Msk                (0x1UL << I3C_BCR_BCR6_Pos)               /*!< 0x00000040 */
#define I3C_BCR_BCR6                    I3C_BCR_BCR6_Msk                          /*!< Device Role shared during Dynamic Address Assignment */

