MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c532xx.h
/* ***********************************  Bit definition for ICACHE_CRRx register  ************************************ */
#define ICACHE_CRRx_BASEADDR_Pos  (0U)
#define ICACHE_CRRx_BASEADDR_Msk  (0xFFUL << ICACHE_CRRx_BASEADDR_Pos)   /*!< 0x000000FF */
#define ICACHE_CRRx_BASEADDR      ICACHE_CRRx_BASEADDR_Msk               /*!< base address for region x */
#define ICACHE_CRRx_BASEADDR_0    (0x1UL << ICACHE_CRRx_BASEADDR_Pos)    /*!< 0x00000001 */
#define ICACHE_CRRx_BASEADDR_1    (0x2UL << ICACHE_CRRx_BASEADDR_Pos)    /*!< 0x00000002 */
#define ICACHE_CRRx_BASEADDR_2    (0x4UL << ICACHE_CRRx_BASEADDR_Pos)    /*!< 0x00000004 */
#define ICACHE_CRRx_BASEADDR_3    (0x8UL << ICACHE_CRRx_BASEADDR_Pos)    /*!< 0x00000008 */
#define ICACHE_CRRx_BASEADDR_4    (0x10UL << ICACHE_CRRx_BASEADDR_Pos)   /*!< 0x00000010 */
#define ICACHE_CRRx_BASEADDR_5    (0x20UL << ICACHE_CRRx_BASEADDR_Pos)   /*!< 0x00000020 */
#define ICACHE_CRRx_BASEADDR_6    (0x40UL << ICACHE_CRRx_BASEADDR_Pos)   /*!< 0x00000040 */
#define ICACHE_CRRx_BASEADDR_7    (0x80UL << ICACHE_CRRx_BASEADDR_Pos)   /*!< 0x00000080 */
#define ICACHE_CRRx_RSIZE_Pos     (9U)
#define ICACHE_CRRx_RSIZE_Msk     (0x7UL << ICACHE_CRRx_RSIZE_Pos)       /*!< 0x00000E00 */
#define ICACHE_CRRx_RSIZE         ICACHE_CRRx_RSIZE_Msk                  /*!< size for region x */
#define ICACHE_CRRx_RSIZE_0       (0x1UL << ICACHE_CRRx_RSIZE_Pos)       /*!< 0x00000200 */
#define ICACHE_CRRx_RSIZE_1       (0x2UL << ICACHE_CRRx_RSIZE_Pos)       /*!< 0x00000400 */
#define ICACHE_CRRx_RSIZE_2       (0x4UL << ICACHE_CRRx_RSIZE_Pos)       /*!< 0x00000800 */
#define ICACHE_CRRx_REN_Pos       (15U)
#define ICACHE_CRRx_REN_Msk       (0x1UL << ICACHE_CRRx_REN_Pos)         /*!< 0x00008000 */
#define ICACHE_CRRx_REN           ICACHE_CRRx_REN_Msk                    /*!< enable for region x */
#define ICACHE_CRRx_REMAPADDR_Pos (16U)
#define ICACHE_CRRx_REMAPADDR_Msk (0x7FFUL << ICACHE_CRRx_REMAPADDR_Pos) /*!< 0x07FF0000 */
#define ICACHE_CRRx_REMAPADDR     ICACHE_CRRx_REMAPADDR_Msk              /*!< remapped address for region x */
#define ICACHE_CRRx_REMAPADDR_0   (0x1UL << ICACHE_CRRx_REMAPADDR_Pos)   /*!< 0x00010000 */
#define ICACHE_CRRx_REMAPADDR_1   (0x2UL << ICACHE_CRRx_REMAPADDR_Pos)   /*!< 0x00020000 */
#define ICACHE_CRRx_REMAPADDR_2   (0x4UL << ICACHE_CRRx_REMAPADDR_Pos)   /*!< 0x00040000 */
#define ICACHE_CRRx_REMAPADDR_3   (0x8UL << ICACHE_CRRx_REMAPADDR_Pos)   /*!< 0x00080000 */
#define ICACHE_CRRx_REMAPADDR_4   (0x10UL << ICACHE_CRRx_REMAPADDR_Pos)  /*!< 0x00100000 */
#define ICACHE_CRRx_REMAPADDR_5   (0x20UL << ICACHE_CRRx_REMAPADDR_Pos)  /*!< 0x00200000 */
#define ICACHE_CRRx_REMAPADDR_6   (0x40UL << ICACHE_CRRx_REMAPADDR_Pos)  /*!< 0x00400000 */
#define ICACHE_CRRx_REMAPADDR_7   (0x80UL << ICACHE_CRRx_REMAPADDR_Pos)  /*!< 0x00800000 */
#define ICACHE_CRRx_REMAPADDR_8   (0x100UL << ICACHE_CRRx_REMAPADDR_Pos) /*!< 0x01000000 */
#define ICACHE_CRRx_REMAPADDR_9   (0x200UL << ICACHE_CRRx_REMAPADDR_Pos) /*!< 0x02000000 */
#define ICACHE_CRRx_REMAPADDR_10  (0x400UL << ICACHE_CRRx_REMAPADDR_Pos) /*!< 0x04000000 */
#define ICACHE_CRRx_HBURST_Pos    (31U)
#define ICACHE_CRRx_HBURST_Msk    (0x1UL << ICACHE_CRRx_HBURST_Pos)      /*!< 0x80000000 */
#define ICACHE_CRRx_HBURST        ICACHE_CRRx_HBURST_Msk                 /*!< output burst type for region x */

/**********************************************************************************************************************/
/*                                                                                                                    */
/*                                        Operational Amplifier (OPAMP)                                               */
/*                                                                                                                    */
/**********************************************************************************************************************/
#define OPAMP_INSTANCES_NB           (1U)

/* ************************************  Bit definition for OPAMP_CSR register  ************************************* */
#define OPAMP_CSR_OPAEN_Pos       (0U)
#define OPAMP_CSR_OPAEN_Msk       (0x1UL << OPAMP_CSR_OPAEN_Pos)         /*!< 0x00000001 */
#define OPAMP_CSR_OPAEN           OPAMP_CSR_OPAEN_Msk                    /*!< Operational amplifier enable */
#define OPAMP_CSR_FORCE_VP_Pos    (1U)
#define OPAMP_CSR_FORCE_VP_Msk    (0x1UL << OPAMP_CSR_FORCE_VP_Pos)      /*!< 0x00000002 */
#define OPAMP_CSR_FORCE_VP        OPAMP_CSR_FORCE_VP_Msk                 /*!< Force internal reference on noninverting
                                                                              input */
#define OPAMP_CSR_VP_SEL_Pos      (2U)
#define OPAMP_CSR_VP_SEL_Msk      (0x3UL << OPAMP_CSR_VP_SEL_Pos)        /*!< 0x0000000C */
#define OPAMP_CSR_VP_SEL          OPAMP_CSR_VP_SEL_Msk                   /*!< Noninverting input primary selection */
#define OPAMP_CSR_VP_SEL_0        (0x1UL << OPAMP_CSR_VP_SEL_Pos)        /*!< 0x00000004 */
#define OPAMP_CSR_VP_SEL_1        (0x2UL << OPAMP_CSR_VP_SEL_Pos)        /*!< 0x00000008 */
#define OPAMP_CSR_USERTRIM_Pos    (4U)
#define OPAMP_CSR_USERTRIM_Msk    (0x1UL << OPAMP_CSR_USERTRIM_Pos)      /*!< 0x00000010 */
#define OPAMP_CSR_USERTRIM        OPAMP_CSR_USERTRIM_Msk                 /*!< User trimming enable */
#define OPAMP_CSR_VM_SEL_Pos      (5U)
#define OPAMP_CSR_VM_SEL_Msk      (0x3UL << OPAMP_CSR_VM_SEL_Pos)        /*!< 0x00000060 */
#define OPAMP_CSR_VM_SEL          OPAMP_CSR_VM_SEL_Msk                   /*!< Inverting input primary selection */
#define OPAMP_CSR_VM_SEL_0        (0x1UL << OPAMP_CSR_VM_SEL_Pos)        /*!< 0x00000020 */
#define OPAMP_CSR_VM_SEL_1        (0x2UL << OPAMP_CSR_VM_SEL_Pos)        /*!< 0x00000040 */
#define OPAMP_CSR_OPAHSM_Pos      (7U)
#define OPAMP_CSR_OPAHSM_Msk      (0x1UL << OPAMP_CSR_OPAHSM_Pos)        /*!< 0x00000080 */
#define OPAMP_CSR_OPAHSM          OPAMP_CSR_OPAHSM_Msk                   /*!< Operational amplifier high-speed mode */
#define OPAMP_CSR_OPAINTOEN_Pos   (8U)
#define OPAMP_CSR_OPAINTOEN_Msk   (0x1UL << OPAMP_CSR_OPAINTOEN_Pos)     /*!< 0x00000100 */
#define OPAMP_CSR_OPAINTOEN       OPAMP_CSR_OPAINTOEN_Msk                /*!< Operational amplifier internal output
                                                                              enable */
#define OPAMP_CSR_CALON_Pos       (11U)
#define OPAMP_CSR_CALON_Msk       (0x1UL << OPAMP_CSR_CALON_Pos)         /*!< 0x00000800 */
#define OPAMP_CSR_CALON           OPAMP_CSR_CALON_Msk                    /*!< Calibration mode enable */
#define OPAMP_CSR_CALSEL_Pos      (12U)
#define OPAMP_CSR_CALSEL_Msk      (0x3UL << OPAMP_CSR_CALSEL_Pos)        /*!< 0x00003000 */
#define OPAMP_CSR_CALSEL          OPAMP_CSR_CALSEL_Msk                   /*!< Calibration selection */
#define OPAMP_CSR_CALSEL_0        (0x1UL << OPAMP_CSR_CALSEL_Pos)        /*!< 0x00001000 */
#define OPAMP_CSR_CALSEL_1        (0x2UL << OPAMP_CSR_CALSEL_Pos)        /*!< 0x00002000 */
#define OPAMP_CSR_PGA_GAIN_Pos    (14U)
#define OPAMP_CSR_PGA_GAIN_Msk    (0x1FUL << OPAMP_CSR_PGA_GAIN_Pos)     /*!< 0x0007C000 */
#define OPAMP_CSR_PGA_GAIN        OPAMP_CSR_PGA_GAIN_Msk                 /*!< Operational amplifier programmable gain
                                                                              and PGA flavor primary control */
#define OPAMP_CSR_PGA_GAIN_0      (0x1UL << OPAMP_CSR_PGA_GAIN_Pos)      /*!< 0x00004000 */
#define OPAMP_CSR_PGA_GAIN_1      (0x2UL << OPAMP_CSR_PGA_GAIN_Pos)      /*!< 0x00008000 */
#define OPAMP_CSR_PGA_GAIN_2      (0x4UL << OPAMP_CSR_PGA_GAIN_Pos)      /*!< 0x00010000 */
#define OPAMP_CSR_PGA_GAIN_3      (0x8UL << OPAMP_CSR_PGA_GAIN_Pos)      /*!< 0x00020000 */
#define OPAMP_CSR_PGA_GAIN_4      (0x10UL << OPAMP_CSR_PGA_GAIN_Pos)     /*!< 0x00040000 */
#define OPAMP_CSR_TRIMOFFSETP_Pos (19U)
#define OPAMP_CSR_TRIMOFFSETP_Msk (0x1FUL << OPAMP_CSR_TRIMOFFSETP_Pos)  /*!< 0x00F80000 */
#define OPAMP_CSR_TRIMOFFSETP     OPAMP_CSR_TRIMOFFSETP_Msk              /*!< Trim for PMOS differential pairs */
#define OPAMP_CSR_TRIMOFFSETN_Pos (24U)
#define OPAMP_CSR_TRIMOFFSETN_Msk (0x1FUL << OPAMP_CSR_TRIMOFFSETN_Pos)  /*!< 0x1F000000 */
#define OPAMP_CSR_TRIMOFFSETN     OPAMP_CSR_TRIMOFFSETN_Msk              /*!< Trim for NMOS differential pairs */
#define OPAMP_CSR_CALOUT_Pos      (30U)
#define OPAMP_CSR_CALOUT_Msk      (0x1UL << OPAMP_CSR_CALOUT_Pos)        /*!< 0x40000000 */
#define OPAMP_CSR_CALOUT          OPAMP_CSR_CALOUT_Msk                   /*!< Operational amplifier calibration output
                                                                              */
#define OPAMP_CSR_LOCK_Pos        (31U)
#define OPAMP_CSR_LOCK_Msk        (0x1UL << OPAMP_CSR_LOCK_Pos)          /*!< 0x80000000 */
#define OPAMP_CSR_LOCK            OPAMP_CSR_LOCK_Msk                     /*!< OPAMP_CSR register lock */

/* ************************************  Bit definition for OPAMP_TCMR register  ************************************ */
#define OPAMP_TCMR_VMS_SEL_Pos    (0U)
#define OPAMP_TCMR_VMS_SEL_Msk    (0x1UL << OPAMP_TCMR_VMS_SEL_Pos)      /*!< 0x00000001 */
#define OPAMP_TCMR_VMS_SEL        OPAMP_TCMR_VMS_SEL_Msk                 /*!< OPAMP inverting input secondary selection
                                                                              */
#define OPAMP_TCMR_VPS_SEL_Pos    (1U)
#define OPAMP_TCMR_VPS_SEL_Msk    (0x3UL << OPAMP_TCMR_VPS_SEL_Pos)      /*!< 0x00000006 */
#define OPAMP_TCMR_VPS_SEL        OPAMP_TCMR_VPS_SEL_Msk                 /*!< OPAMP noninverting input secondary
                                                                              selection. */
#define OPAMP_TCMR_VPS_SEL_0      (0x1UL << OPAMP_TCMR_VPS_SEL_Pos)      /*!< 0x00000002 */
#define OPAMP_TCMR_VPS_SEL_1      (0x2UL << OPAMP_TCMR_VPS_SEL_Pos)      /*!< 0x00000004 */
#define OPAMP_TCMR_TIMCM_SEL_Pos  (3U)
#define OPAMP_TCMR_TIMCM_SEL_Msk  (0x7UL << OPAMP_TCMR_TIMCM_SEL_Pos)    /*!< 0x00000038 */
#define OPAMP_TCMR_TIMCM_SEL      OPAMP_TCMR_TIMCM_SEL_Msk               /*!< Timer toggle signal selection for
                                                                              operational amplifier input control */
#define OPAMP_TCMR_TIMCM_SEL_0    (0x1UL << OPAMP_TCMR_TIMCM_SEL_Pos)    /*!< 0x00000008 */
#define OPAMP_TCMR_TIMCM_SEL_1    (0x2UL << OPAMP_TCMR_TIMCM_SEL_Pos)    /*!< 0x00000010 */
#define OPAMP_TCMR_TIMCM_SEL_2    (0x4UL << OPAMP_TCMR_TIMCM_SEL_Pos)    /*!< 0x00000020 */
#define OPAMP_TCMR_PGAS_GAIN_Pos  (8U)
#define OPAMP_TCMR_PGAS_GAIN_Msk  (0x1FUL << OPAMP_TCMR_PGAS_GAIN_Pos)   /*!< 0x00001F00 */
#define OPAMP_TCMR_PGAS_GAIN      OPAMP_TCMR_PGAS_GAIN_Msk               /*!< Operational amplifier programmable gain
                                                                              and PGA flavor secondary control */
#define OPAMP_TCMR_PGAS_GAIN_0    (0x1UL << OPAMP_TCMR_PGAS_GAIN_Pos)    /*!< 0x00000100 */
#define OPAMP_TCMR_PGAS_GAIN_1    (0x2UL << OPAMP_TCMR_PGAS_GAIN_Pos)    /*!< 0x00000200 */
#define OPAMP_TCMR_PGAS_GAIN_2    (0x4UL << OPAMP_TCMR_PGAS_GAIN_Pos)    /*!< 0x00000400 */
#define OPAMP_TCMR_PGAS_GAIN_3    (0x8UL << OPAMP_TCMR_PGAS_GAIN_Pos)    /*!< 0x00000800 */
#define OPAMP_TCMR_PGAS_GAIN_4    (0x10UL << OPAMP_TCMR_PGAS_GAIN_Pos)   /*!< 0x00001000 */
#define OPAMP_TCMR_TIMPGA_SEL_Pos (13U)
#define OPAMP_TCMR_TIMPGA_SEL_Msk (0x7UL << OPAMP_TCMR_TIMPGA_SEL_Pos)   /*!< 0x0000E000 */
#define OPAMP_TCMR_TIMPGA_SEL     OPAMP_TCMR_TIMPGA_SEL_Msk              /*!< Timer toggle signal selection for
                                                                              programmable gain control */
#define OPAMP_TCMR_TIMPGA_SEL_0   (0x1UL << OPAMP_TCMR_TIMPGA_SEL_Pos)   /*!< 0x00002000 */
#define OPAMP_TCMR_TIMPGA_SEL_1   (0x2UL << OPAMP_TCMR_TIMPGA_SEL_Pos)   /*!< 0x00004000 */
#define OPAMP_TCMR_TIMPGA_SEL_2   (0x4UL << OPAMP_TCMR_TIMPGA_SEL_Pos)   /*!< 0x00008000 */
#define OPAMP_TCMR_LOCK_Pos       (31U)
#define OPAMP_TCMR_LOCK_Msk       (0x1UL << OPAMP_TCMR_LOCK_Pos)         /*!< 0x80000000 */
#define OPAMP_TCMR_LOCK           OPAMP_TCMR_LOCK_Msk                    /*!< OPAMP_TCMR register lock */

/**********************************************************************************************************************/
/*                                                                                                                    */
/*                                            Power Control (PWR)                                                     */
/*                                                                                                                    */
/**********************************************************************************************************************/
/* *************************************  Bit definition for PWR_PMCR register  ************************************* */
#define PWR_PMCR_LPMS_Pos          (0U)
#define PWR_PMCR_LPMS_Msk          (0x3UL << PWR_PMCR_LPMS_Pos)            /*!< 0x00000003 */
#define PWR_PMCR_LPMS              PWR_PMCR_LPMS_Msk                       /*!< low-power mode selection */
#define PWR_PMCR_LPMS_0            (0x1UL << PWR_PMCR_LPMS_Pos)            /*!< 0x00000001 */
#define PWR_PMCR_LPMS_1            (0x2UL << PWR_PMCR_LPMS_Pos)            /*!< 0x00000002 */
#define PWR_PMCR_CSSF_Pos          (7U)
#define PWR_PMCR_CSSF_Msk          (0x1UL << PWR_PMCR_CSSF_Pos)            /*!< 0x00000080 */
#define PWR_PMCR_CSSF              PWR_PMCR_CSSF_Msk                       /*!< Clear Standby and Stop flags (always
                                                                                read as 0) */
#define PWR_PMCR_FLPS_Pos          (9U)
#define PWR_PMCR_FLPS_Msk          (0x1UL << PWR_PMCR_FLPS_Pos)            /*!< 0x00000200 */
#define PWR_PMCR_FLPS              PWR_PMCR_FLPS_Msk                       /*!< Flash memory low-power mode in Stop mode
                                                                                */
#define PWR_PMCR_SRAM2_1_SO_Pos    (24U)
#define PWR_PMCR_SRAM2_1_SO_Msk    (0x1UL << PWR_PMCR_SRAM2_1_SO_Pos)      /*!< 0x01000000 */
#define PWR_PMCR_SRAM2_1_SO        PWR_PMCR_SRAM2_1_SO_Msk                 /*!< AHB SRAM2 block 1 shut-off in Stop mode
                                                                                */
#define PWR_PMCR_SRAM2_2_SO_Pos    (25U)
#define PWR_PMCR_SRAM2_2_SO_Msk    (0x1UL << PWR_PMCR_SRAM2_2_SO_Pos)      /*!< 0x02000000 */
#define PWR_PMCR_SRAM2_2_SO        PWR_PMCR_SRAM2_2_SO_Msk                 /*!< AHB SRAM2 block 2 shut-off in Stop mode
                                                                                */
#define PWR_PMCR_SRAM1SO_Pos       (26U)
#define PWR_PMCR_SRAM1SO_Msk       (0x1UL << PWR_PMCR_SRAM1SO_Pos)         /*!< 0x04000000 */
#define PWR_PMCR_SRAM1SO           PWR_PMCR_SRAM1SO_Msk                    /*!< AHB SRAM1 block 1 shut-off in Stop mode
                                                                                */

/* *************************************  Bit definition for PWR_PMSR register  ************************************* */
#define PWR_PMSR_STOPF_Pos         (5U)
#define PWR_PMSR_STOPF_Msk         (0x1UL << PWR_PMSR_STOPF_Pos)           /*!< 0x00000020 */
#define PWR_PMSR_STOPF             PWR_PMSR_STOPF_Msk                      /*!< Stop flag */
#define PWR_PMSR_SBF_Pos           (6U)
#define PWR_PMSR_SBF_Msk           (0x1UL << PWR_PMSR_SBF_Pos)             /*!< 0x00000040 */
#define PWR_PMSR_SBF               PWR_PMSR_SBF_Msk                        /*!< System standby flag */

/* ************************************  Bit definition for PWR_RTCCR register  ************************************* */
#define PWR_RTCCR_DRTCP_Pos        (0U)
#define PWR_RTCCR_DRTCP_Msk        (0x1UL << PWR_RTCCR_DRTCP_Pos)          /*!< 0x00000001 */
#define PWR_RTCCR_DRTCP            PWR_RTCCR_DRTCP_Msk                     /*!< Disable RTC domain write protection */

/* *************************************  Bit definition for PWR_VMCR register  ************************************* */
#define PWR_VMCR_PVDE_Pos          (0U)
#define PWR_VMCR_PVDE_Msk          (0x1UL << PWR_VMCR_PVDE_Pos)            /*!< 0x00000001 */
#define PWR_VMCR_PVDE              PWR_VMCR_PVDE_Msk                       /*!< PVD enable */

/* *************************************  Bit definition for PWR_VMSR register  ************************************* */
#define PWR_VMSR_PVDO_Pos          (22U)
#define PWR_VMSR_PVDO_Msk          (0x1UL << PWR_VMSR_PVDO_Pos)            /*!< 0x00400000 */
#define PWR_VMSR_PVDO              PWR_VMSR_PVDO_Msk                       /*!< programmable voltage detect output */

