MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c532xx.h
/* **********************************   Bit definition for RAMCFG_SEAR register   *********************************** */
#define RAMCFG_SEAR_ESEA_Pos       (0U)
#define RAMCFG_SEAR_ESEA_Msk       (0xFFFFFFFFUL << RAMCFG_SEAR_ESEA_Pos)  /*!< 0xFFFFFFFF */
#define RAMCFG_SEAR_ESEA           RAMCFG_SEAR_ESEA_Msk                    /*!< ECC single error address */

/* **********************************   Bit definition for RAMCFG_DEAR register   *********************************** */
#define RAMCFG_DEAR_EDEA_Pos       (0U)
#define RAMCFG_DEAR_EDEA_Msk       (0xFFFFFFFFUL << RAMCFG_DEAR_EDEA_Pos)  /*!< 0xFFFFFFFF */
#define RAMCFG_DEAR_EDEA           RAMCFG_DEAR_EDEA_Msk                    /*!< ECC double error address */

/* ***********************************   Bit definition for RAMCFG_ICR register   *********************************** */
#define RAMCFG_ICR_CSEDC_Pos       (0U)
#define RAMCFG_ICR_CSEDC_Msk       (0x1UL << RAMCFG_ICR_CSEDC_Pos)         /*!< 0x00000001 */
#define RAMCFG_ICR_CSEDC           RAMCFG_ICR_CSEDC_Msk                    /*!< Clear ECC single error detected and
                                                                                corrected */
#define RAMCFG_ICR_CDED_Pos        (1U)
#define RAMCFG_ICR_CDED_Msk        (0x1UL << RAMCFG_ICR_CDED_Pos)          /*!< 0x00000002 */
#define RAMCFG_ICR_CDED            RAMCFG_ICR_CDED_Msk                     /*!< Clear ECC double error detected */

/* **********************************   Bit definition for RAMCFG_WPR1 register   *********************************** */
#define RAMCFG_WPR1_P0WP_Pos       (0U)
#define RAMCFG_WPR1_P0WP_Msk       (0x1UL << RAMCFG_WPR1_P0WP_Pos)         /*!< 0x00000001 */
#define RAMCFG_WPR1_P0WP           RAMCFG_WPR1_P0WP_Msk                    /*!< Write Protection Page 00 */
#define RAMCFG_WPR1_P1WP_Pos       (1U)
#define RAMCFG_WPR1_P1WP_Msk       (0x1UL << RAMCFG_WPR1_P1WP_Pos)         /*!< 0x00000002 */
#define RAMCFG_WPR1_P1WP           RAMCFG_WPR1_P1WP_Msk                    /*!< Write Protection Page 01 */
#define RAMCFG_WPR1_P2WP_Pos       (2U)
#define RAMCFG_WPR1_P2WP_Msk       (0x1UL << RAMCFG_WPR1_P2WP_Pos)         /*!< 0x00000004 */
#define RAMCFG_WPR1_P2WP           RAMCFG_WPR1_P2WP_Msk                    /*!< Write Protection Page 02 */
#define RAMCFG_WPR1_P3WP_Pos       (3U)
#define RAMCFG_WPR1_P3WP_Msk       (0x1UL << RAMCFG_WPR1_P3WP_Pos)         /*!< 0x00000008 */
#define RAMCFG_WPR1_P3WP           RAMCFG_WPR1_P3WP_Msk                    /*!< Write Protection Page 03 */
#define RAMCFG_WPR1_P4WP_Pos       (4U)
#define RAMCFG_WPR1_P4WP_Msk       (0x1UL << RAMCFG_WPR1_P4WP_Pos)         /*!< 0x00000010 */
#define RAMCFG_WPR1_P4WP           RAMCFG_WPR1_P4WP_Msk                    /*!< Write Protection Page 04 */
#define RAMCFG_WPR1_P5WP_Pos       (5U)
#define RAMCFG_WPR1_P5WP_Msk       (0x1UL << RAMCFG_WPR1_P5WP_Pos)         /*!< 0x00000020 */
#define RAMCFG_WPR1_P5WP           RAMCFG_WPR1_P5WP_Msk                    /*!< Write Protection Page 05 */
#define RAMCFG_WPR1_P6WP_Pos       (6U)
#define RAMCFG_WPR1_P6WP_Msk       (0x1UL << RAMCFG_WPR1_P6WP_Pos)         /*!< 0x00000040 */
#define RAMCFG_WPR1_P6WP           RAMCFG_WPR1_P6WP_Msk                    /*!< Write Protection Page 06 */
#define RAMCFG_WPR1_P7WP_Pos       (7U)
#define RAMCFG_WPR1_P7WP_Msk       (0x1UL << RAMCFG_WPR1_P7WP_Pos)         /*!< 0x00000080 */
#define RAMCFG_WPR1_P7WP           RAMCFG_WPR1_P7WP_Msk                    /*!< Write Protection Page 07 */
#define RAMCFG_WPR1_P8WP_Pos       (8U)
#define RAMCFG_WPR1_P8WP_Msk       (0x1UL << RAMCFG_WPR1_P8WP_Pos)         /*!< 0x00000100 */
#define RAMCFG_WPR1_P8WP           RAMCFG_WPR1_P8WP_Msk                    /*!< Write Protection Page 08 */
#define RAMCFG_WPR1_P9WP_Pos       (9U)
#define RAMCFG_WPR1_P9WP_Msk       (0x1UL << RAMCFG_WPR1_P9WP_Pos)         /*!< 0x00000200 */
#define RAMCFG_WPR1_P9WP           RAMCFG_WPR1_P9WP_Msk                    /*!< Write Protection Page 09 */
#define RAMCFG_WPR1_P10WP_Pos      (10U)
#define RAMCFG_WPR1_P10WP_Msk      (0x1UL << RAMCFG_WPR1_P10WP_Pos)        /*!< 0x00000400 */
#define RAMCFG_WPR1_P10WP          RAMCFG_WPR1_P10WP_Msk                   /*!< Write Protection Page 10 */
#define RAMCFG_WPR1_P11WP_Pos      (11U)
#define RAMCFG_WPR1_P11WP_Msk      (0x1UL << RAMCFG_WPR1_P11WP_Pos)        /*!< 0x00000800 */
#define RAMCFG_WPR1_P11WP          RAMCFG_WPR1_P11WP_Msk                   /*!< Write Protection Page 11 */
#define RAMCFG_WPR1_P12WP_Pos      (12U)
#define RAMCFG_WPR1_P12WP_Msk      (0x1UL << RAMCFG_WPR1_P12WP_Pos)        /*!< 0x00001000 */
#define RAMCFG_WPR1_P12WP          RAMCFG_WPR1_P12WP_Msk                   /*!< Write Protection Page 12 */
#define RAMCFG_WPR1_P13WP_Pos      (13U)
#define RAMCFG_WPR1_P13WP_Msk      (0x1UL << RAMCFG_WPR1_P13WP_Pos)        /*!< 0x00002000 */
#define RAMCFG_WPR1_P13WP          RAMCFG_WPR1_P13WP_Msk                   /*!< Write Protection Page 13 */
#define RAMCFG_WPR1_P14WP_Pos      (14U)
#define RAMCFG_WPR1_P14WP_Msk      (0x1UL << RAMCFG_WPR1_P14WP_Pos)        /*!< 0x00004000 */
#define RAMCFG_WPR1_P14WP          RAMCFG_WPR1_P14WP_Msk                   /*!< Write Protection Page 14 */
#define RAMCFG_WPR1_P15WP_Pos      (15U)
#define RAMCFG_WPR1_P15WP_Msk      (0x1UL << RAMCFG_WPR1_P15WP_Pos)        /*!< 0x00008000 */
#define RAMCFG_WPR1_P15WP          RAMCFG_WPR1_P15WP_Msk                   /*!< Write Protection Page 15 */
#define RAMCFG_WPR1_P16WP_Pos      (16U)
#define RAMCFG_WPR1_P16WP_Msk      (0x1UL << RAMCFG_WPR1_P16WP_Pos)        /*!< 0x00010000 */
#define RAMCFG_WPR1_P16WP          RAMCFG_WPR1_P16WP_Msk                   /*!< Write Protection Page 16 */
#define RAMCFG_WPR1_P17WP_Pos      (17U)
#define RAMCFG_WPR1_P17WP_Msk      (0x1UL << RAMCFG_WPR1_P17WP_Pos)        /*!< 0x00020000 */
#define RAMCFG_WPR1_P17WP          RAMCFG_WPR1_P17WP_Msk                   /*!< Write Protection Page 17 */
#define RAMCFG_WPR1_P18WP_Pos      (18U)
#define RAMCFG_WPR1_P18WP_Msk      (0x1UL << RAMCFG_WPR1_P18WP_Pos)        /*!< 0x00040000 */
#define RAMCFG_WPR1_P18WP          RAMCFG_WPR1_P18WP_Msk                   /*!< Write Protection Page 18 */
#define RAMCFG_WPR1_P19WP_Pos      (19U)
#define RAMCFG_WPR1_P19WP_Msk      (0x1UL << RAMCFG_WPR1_P19WP_Pos)        /*!< 0x00080000 */
#define RAMCFG_WPR1_P19WP          RAMCFG_WPR1_P19WP_Msk                   /*!< Write Protection Page 19 */
#define RAMCFG_WPR1_P20WP_Pos      (20U)
#define RAMCFG_WPR1_P20WP_Msk      (0x1UL << RAMCFG_WPR1_P20WP_Pos)        /*!< 0x00100000 */
#define RAMCFG_WPR1_P20WP          RAMCFG_WPR1_P20WP_Msk                   /*!< Write Protection Page 20 */
#define RAMCFG_WPR1_P21WP_Pos      (21U)
#define RAMCFG_WPR1_P21WP_Msk      (0x1UL << RAMCFG_WPR1_P21WP_Pos)        /*!< 0x00200000 */
#define RAMCFG_WPR1_P21WP          RAMCFG_WPR1_P21WP_Msk                   /*!< Write Protection Page 21 */
#define RAMCFG_WPR1_P22WP_Pos      (22U)
#define RAMCFG_WPR1_P22WP_Msk      (0x1UL << RAMCFG_WPR1_P22WP_Pos)        /*!< 0x00400000 */
#define RAMCFG_WPR1_P22WP          RAMCFG_WPR1_P22WP_Msk                   /*!< Write Protection Page 22 */
#define RAMCFG_WPR1_P23WP_Pos      (23U)
#define RAMCFG_WPR1_P23WP_Msk      (0x1UL << RAMCFG_WPR1_P23WP_Pos)        /*!< 0x00800000 */
#define RAMCFG_WPR1_P23WP          RAMCFG_WPR1_P23WP_Msk                   /*!< Write Protection Page 23 */
#define RAMCFG_WPR1_P24WP_Pos      (24U)
#define RAMCFG_WPR1_P24WP_Msk      (0x1UL << RAMCFG_WPR1_P24WP_Pos)        /*!< 0x01000000 */
#define RAMCFG_WPR1_P24WP          RAMCFG_WPR1_P24WP_Msk                   /*!< Write Protection Page 24 */
#define RAMCFG_WPR1_P25WP_Pos      (25U)
#define RAMCFG_WPR1_P25WP_Msk      (0x1UL << RAMCFG_WPR1_P25WP_Pos)        /*!< 0x02000000 */
#define RAMCFG_WPR1_P25WP          RAMCFG_WPR1_P25WP_Msk                   /*!< Write Protection Page 25 */
#define RAMCFG_WPR1_P26WP_Pos      (26U)
#define RAMCFG_WPR1_P26WP_Msk      (0x1UL << RAMCFG_WPR1_P26WP_Pos)        /*!< 0x04000000 */
#define RAMCFG_WPR1_P26WP          RAMCFG_WPR1_P26WP_Msk                   /*!< Write Protection Page 26 */
#define RAMCFG_WPR1_P27WP_Pos      (27U)
#define RAMCFG_WPR1_P27WP_Msk      (0x1UL << RAMCFG_WPR1_P27WP_Pos)        /*!< 0x08000000 */
#define RAMCFG_WPR1_P27WP          RAMCFG_WPR1_P27WP_Msk                   /*!< Write Protection Page 27 */
#define RAMCFG_WPR1_P28WP_Pos      (28U)
#define RAMCFG_WPR1_P28WP_Msk      (0x1UL << RAMCFG_WPR1_P28WP_Pos)        /*!< 0x10000000 */
#define RAMCFG_WPR1_P28WP          RAMCFG_WPR1_P28WP_Msk                   /*!< Write Protection Page 28 */
#define RAMCFG_WPR1_P29WP_Pos      (29U)
#define RAMCFG_WPR1_P29WP_Msk      (0x1UL << RAMCFG_WPR1_P29WP_Pos)        /*!< 0x20000000 */
#define RAMCFG_WPR1_P29WP          RAMCFG_WPR1_P29WP_Msk                   /*!< Write Protection Page 29 */
#define RAMCFG_WPR1_P30WP_Pos      (30U)
#define RAMCFG_WPR1_P30WP_Msk      (0x1UL << RAMCFG_WPR1_P30WP_Pos)        /*!< 0x40000000 */
#define RAMCFG_WPR1_P30WP          RAMCFG_WPR1_P30WP_Msk                   /*!< Write Protection Page 30 */
#define RAMCFG_WPR1_P31WP_Pos      (31U)
#define RAMCFG_WPR1_P31WP_Msk      (0x1UL << RAMCFG_WPR1_P31WP_Pos)        /*!< 0x80000000 */
#define RAMCFG_WPR1_P31WP          RAMCFG_WPR1_P31WP_Msk                   /*!< Write Protection Page 31 */

/* *********************************   Bit definition for RAMCFG_ECCKEYR register   ********************************* */
#define RAMCFG_ECCKEYR_ECCKEY_Pos  (0U)
#define RAMCFG_ECCKEYR_ECCKEY_Msk  (0xFFUL << RAMCFG_ECCKEYR_ECCKEY_Pos)   /*!< 0x000000FF */
#define RAMCFG_ECCKEYR_ECCKEY      RAMCFG_ECCKEYR_ECCKEY_Msk               /*!< ECC write protection key */

/* *********************************   Bit definition for RAMCFG_ERKEYR register   ********************************** */
#define RAMCFG_ERKEYR_ERASEKEY_Pos (0U)
#define RAMCFG_ERKEYR_ERASEKEY_Msk (0xFFUL << RAMCFG_ERKEYR_ERASEKEY_Pos)  /*!< 0x000000FF */
#define RAMCFG_ERKEYR_ERASEKEY     RAMCFG_ERKEYR_ERASEKEY_Msk              /*!< Erase write protection key */

/**********************************************************************************************************************/
/*                                                                                                                    */
/*                                           Reset and Clock Control (RCC)                                            */
/*                                                                                                                    */
/**********************************************************************************************************************/
/* *************************************  Bit definition for RCC_CR1 register  ************************************** */
#define RCC_CR1_Rst                   (0x00000022UL)                             /*!< RCC_CR1 reset value */
#define RCC_CR1_HSISON_Pos            (0U)
#define RCC_CR1_HSISON_Msk            (0x1UL << RCC_CR1_HSISON_Pos)              /*!< 0x00000001 */
#define RCC_CR1_HSISON                RCC_CR1_HSISON_Msk                         /*!< HSIS clock enable */
#define RCC_CR1_HSIDIV3ON_Pos         (1U)
#define RCC_CR1_HSIDIV3ON_Msk         (0x1UL << RCC_CR1_HSIDIV3ON_Pos)           /*!< 0x00000002 */
#define RCC_CR1_HSIDIV3ON             RCC_CR1_HSIDIV3ON_Msk                      /*!< HSIDIV3 clock enable */
#define RCC_CR1_HSIKON_Pos            (2U)
#define RCC_CR1_HSIKON_Msk            (0x1UL << RCC_CR1_HSIKON_Pos)              /*!< 0x00000004 */
#define RCC_CR1_HSIKON                RCC_CR1_HSIKON_Msk                         /*!< HSIK clock enable */
#define RCC_CR1_HSIKERON_Pos          (3U)
#define RCC_CR1_HSIKERON_Msk          (0x1UL << RCC_CR1_HSIKERON_Pos)            /*!< 0x00000008 */
#define RCC_CR1_HSIKERON              RCC_CR1_HSIKERON_Msk                       /*!< HSI clock enable in Stop mode */
#define RCC_CR1_HSISRDY_Pos           (4U)
#define RCC_CR1_HSISRDY_Msk           (0x1UL << RCC_CR1_HSISRDY_Pos)             /*!< 0x00000010 */
#define RCC_CR1_HSISRDY               RCC_CR1_HSISRDY_Msk                        /*!< HSIS clock ready flag */
#define RCC_CR1_HSIDIV3RDY_Pos        (5U)
#define RCC_CR1_HSIDIV3RDY_Msk        (0x1UL << RCC_CR1_HSIDIV3RDY_Pos)          /*!< 0x00000020 */
#define RCC_CR1_HSIDIV3RDY            RCC_CR1_HSIDIV3RDY_Msk                     /*!< HSIDIV3 clock ready flag */
#define RCC_CR1_HSIKRDY_Pos           (6U)
#define RCC_CR1_HSIKRDY_Msk           (0x1UL << RCC_CR1_HSIKRDY_Pos)             /*!< 0x00000040 */
#define RCC_CR1_HSIKRDY               RCC_CR1_HSIKRDY_Msk                        /*!< HSIK clock ready flag */
#define RCC_CR1_PSISON_Pos            (8U)
#define RCC_CR1_PSISON_Msk            (0x1UL << RCC_CR1_PSISON_Pos)              /*!< 0x00000100 */
#define RCC_CR1_PSISON                RCC_CR1_PSISON_Msk                         /*!< PSIS clock enable */
#define RCC_CR1_PSIDIV3ON_Pos         (9U)
#define RCC_CR1_PSIDIV3ON_Msk         (0x1UL << RCC_CR1_PSIDIV3ON_Pos)           /*!< 0x00000200 */
#define RCC_CR1_PSIDIV3ON             RCC_CR1_PSIDIV3ON_Msk                      /*!< PSIDIV3 clock enable */
#define RCC_CR1_PSIKON_Pos            (10U)
#define RCC_CR1_PSIKON_Msk            (0x1UL << RCC_CR1_PSIKON_Pos)              /*!< 0x00000400 */
#define RCC_CR1_PSIKON                RCC_CR1_PSIKON_Msk                         /*!< PSIK clock enable */
#define RCC_CR1_PSIKERON_Pos          (11U)
#define RCC_CR1_PSIKERON_Msk          (0x1UL << RCC_CR1_PSIKERON_Pos)            /*!< 0x00000800 */
#define RCC_CR1_PSIKERON              RCC_CR1_PSIKERON_Msk                       /*!< PSI clock enable in Stop mode */
#define RCC_CR1_PSISRDY_Pos           (12U)
#define RCC_CR1_PSISRDY_Msk           (0x1UL << RCC_CR1_PSISRDY_Pos)             /*!< 0x00001000 */
#define RCC_CR1_PSISRDY               RCC_CR1_PSISRDY_Msk                        /*!< PSIS clock ready flag */
#define RCC_CR1_PSIDIV3RDY_Pos        (13U)
#define RCC_CR1_PSIDIV3RDY_Msk        (0x1UL << RCC_CR1_PSIDIV3RDY_Pos)          /*!< 0x00002000 */
#define RCC_CR1_PSIDIV3RDY            RCC_CR1_PSIDIV3RDY_Msk                     /*!< PSIDIV3 clock ready flag */
#define RCC_CR1_PSIKRDY_Pos           (14U)
#define RCC_CR1_PSIKRDY_Msk           (0x1UL << RCC_CR1_PSIKRDY_Pos)             /*!< 0x00004000 */
#define RCC_CR1_PSIKRDY               RCC_CR1_PSIKRDY_Msk                        /*!< PSIK clock ready flag */
#define RCC_CR1_HSEON_Pos             (16U)
#define RCC_CR1_HSEON_Msk             (0x1UL << RCC_CR1_HSEON_Pos)               /*!< 0x00010000 */
#define RCC_CR1_HSEON                 RCC_CR1_HSEON_Msk                          /*!< HSE clock enable */
#define RCC_CR1_HSERDY_Pos            (17U)
#define RCC_CR1_HSERDY_Msk            (0x1UL << RCC_CR1_HSERDY_Pos)              /*!< 0x00020000 */
#define RCC_CR1_HSERDY                RCC_CR1_HSERDY_Msk                         /*!< HSE clock ready flag */
#define RCC_CR1_HSEBYP_Pos            (18U)
#define RCC_CR1_HSEBYP_Msk            (0x1UL << RCC_CR1_HSEBYP_Pos)              /*!< 0x00040000 */
#define RCC_CR1_HSEBYP                RCC_CR1_HSEBYP_Msk                         /*!< HSE clock bypass */
#define RCC_CR1_HSECSSON_Pos          (19U)
#define RCC_CR1_HSECSSON_Msk          (0x1UL << RCC_CR1_HSECSSON_Pos)            /*!< 0x00080000 */
#define RCC_CR1_HSECSSON              RCC_CR1_HSECSSON_Msk                       /*!< HSE clock security system enable
                                                                                      */
#define RCC_CR1_HSEEXT_Pos            (20U)
#define RCC_CR1_HSEEXT_Msk            (0x1UL << RCC_CR1_HSEEXT_Pos)              /*!< 0x00100000 */
#define RCC_CR1_HSEEXT                RCC_CR1_HSEEXT_Msk                         /*!< External high speed clock type in
                                                                                      Bypass mode */

/* *************************************  Bit definition for RCC_CR2 register  ************************************** */
#define RCC_CR2_Rst                   (0x00000000UL)                             /*!< RCC_CR2 reset value */
#define RCC_CR2_HSIKDIV_Pos           (0U)
#define RCC_CR2_HSIKDIV_Msk           (0xFUL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x0000000F */
#define RCC_CR2_HSIKDIV               RCC_CR2_HSIKDIV_Msk                        /*!< HSI clock out divider factor */
#define RCC_CR2_HSIKDIV_0             (0x1UL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x00000001 */
#define RCC_CR2_HSIKDIV_1             (0x2UL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x00000002 */
#define RCC_CR2_HSIKDIV_2             (0x4UL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x00000004 */
#define RCC_CR2_HSIKDIV_3             (0x8UL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x00000008 */
#define RCC_CR2_PSIKDIV_Pos           (8U)
#define RCC_CR2_PSIKDIV_Msk           (0xFUL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000F00 */
#define RCC_CR2_PSIKDIV               RCC_CR2_PSIKDIV_Msk                        /*!< PSI clock out divider factor */
#define RCC_CR2_PSIKDIV_0             (0x1UL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000100 */
#define RCC_CR2_PSIKDIV_1             (0x2UL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000200 */
#define RCC_CR2_PSIKDIV_2             (0x4UL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000400 */
#define RCC_CR2_PSIKDIV_3             (0x8UL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000800 */
#define RCC_CR2_PSIREFSRC_Pos         (16U)
#define RCC_CR2_PSIREFSRC_Msk         (0x3UL << RCC_CR2_PSIREFSRC_Pos)           /*!< 0x00030000 */
#define RCC_CR2_PSIREFSRC             RCC_CR2_PSIREFSRC_Msk                      /*!< PSI reference clock source
                                                                                      selection */
#define RCC_CR2_PSIREFSRC_0           (0x1UL << RCC_CR2_PSIREFSRC_Pos)           /*!< 0x00010000 */
#define RCC_CR2_PSIREFSRC_1           (0x2UL << RCC_CR2_PSIREFSRC_Pos)           /*!< 0x00020000 */
#define RCC_CR2_PSIREF_Pos            (20U)
#define RCC_CR2_PSIREF_Msk            (0x7UL << RCC_CR2_PSIREF_Pos)              /*!< 0x00700000 */
#define RCC_CR2_PSIREF                RCC_CR2_PSIREF_Msk                         /*!< PSI reference clock frequency
                                                                                      selection */
#define RCC_CR2_PSIREF_0              (0x1UL << RCC_CR2_PSIREF_Pos)              /*!< 0x00100000 */
#define RCC_CR2_PSIREF_1              (0x2UL << RCC_CR2_PSIREF_Pos)              /*!< 0x00200000 */
#define RCC_CR2_PSIREF_2              (0x4UL << RCC_CR2_PSIREF_Pos)              /*!< 0x00400000 */
#define RCC_CR2_PSIFREQ_Pos           (28U)
#define RCC_CR2_PSIFREQ_Msk           (0x3UL << RCC_CR2_PSIFREQ_Pos)             /*!< 0x30000000 */
#define RCC_CR2_PSIFREQ               RCC_CR2_PSIFREQ_Msk                        /*!< PSI target frequency configuration
                                                                                      */
#define RCC_CR2_PSIFREQ_0             (0x1UL << RCC_CR2_PSIFREQ_Pos)             /*!< 0x10000000 */
#define RCC_CR2_PSIFREQ_1             (0x2UL << RCC_CR2_PSIFREQ_Pos)             /*!< 0x20000000 */

