MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c532xx.h
/* ************************************  Bit definition for RCC_CFGR1 register  ************************************* */
#define RCC_CFGR1_Rst                 (0x00000000UL)                             /*!< RCC_CFGR1 reset value */
#define RCC_CFGR1_SW_Pos              (0U)
#define RCC_CFGR1_SW_Msk              (0x3UL << RCC_CFGR1_SW_Pos)                /*!< 0x00000003 */
#define RCC_CFGR1_SW                  RCC_CFGR1_SW_Msk                           /*!< System clock and trace clock
                                                                                      switch */
#define RCC_CFGR1_SW_0                (0x1UL << RCC_CFGR1_SW_Pos)                /*!< 0x00000001 */
#define RCC_CFGR1_SW_1                (0x2UL << RCC_CFGR1_SW_Pos)                /*!< 0x00000002 */
#define RCC_CFGR1_SWS_Pos             (3U)
#define RCC_CFGR1_SWS_Msk             (0x3UL << RCC_CFGR1_SWS_Pos)               /*!< 0x00000018 */
#define RCC_CFGR1_SWS                 RCC_CFGR1_SWS_Msk                          /*!< System clock switch status */
#define RCC_CFGR1_SWS_0               (0x1UL << RCC_CFGR1_SWS_Pos)               /*!< 0x00000008 */
#define RCC_CFGR1_SWS_1               (0x2UL << RCC_CFGR1_SWS_Pos)               /*!< 0x00000010 */
#define RCC_CFGR1_STOPWUCK_Pos        (6U)
#define RCC_CFGR1_STOPWUCK_Msk        (0x1UL << RCC_CFGR1_STOPWUCK_Pos)          /*!< 0x00000040 */
#define RCC_CFGR1_STOPWUCK            RCC_CFGR1_STOPWUCK_Msk                     /*!< System clock selection after a
                                                                                      wake-up from system Stop mode */
#define RCC_CFGR1_RTCPRE_Pos          (7U)
#define RCC_CFGR1_RTCPRE_Msk          (0x1FFUL << RCC_CFGR1_RTCPRE_Pos)          /*!< 0x0000FF80 */
#define RCC_CFGR1_RTCPRE              RCC_CFGR1_RTCPRE_Msk                       /*!< HSE division factor for RTC clock
                                                                                      (source of HSE_1MHz clock) */
#define RCC_CFGR1_RTCPRE_0            (0x1UL << RCC_CFGR1_RTCPRE_Pos)            /*!< 0x00000080 */
#define RCC_CFGR1_RTCPRE_1            (0x2UL << RCC_CFGR1_RTCPRE_Pos)            /*!< 0x00000100 */
#define RCC_CFGR1_RTCPRE_2            (0x4UL << RCC_CFGR1_RTCPRE_Pos)            /*!< 0x00000200 */
#define RCC_CFGR1_RTCPRE_3            (0x8UL << RCC_CFGR1_RTCPRE_Pos)            /*!< 0x00000400 */
#define RCC_CFGR1_RTCPRE_4            (0x10UL << RCC_CFGR1_RTCPRE_Pos)           /*!< 0x00000800 */
#define RCC_CFGR1_RTCPRE_5            (0x20UL << RCC_CFGR1_RTCPRE_Pos)           /*!< 0x00001000 */
#define RCC_CFGR1_RTCPRE_6            (0x40UL << RCC_CFGR1_RTCPRE_Pos)           /*!< 0x00002000 */
#define RCC_CFGR1_RTCPRE_7            (0x80UL << RCC_CFGR1_RTCPRE_Pos)           /*!< 0x00004000 */
#define RCC_CFGR1_RTCPRE_8            (0x100UL << RCC_CFGR1_RTCPRE_Pos)          /*!< 0x00008000 */
#define RCC_CFGR1_MCO1PRE_Pos         (18U)
#define RCC_CFGR1_MCO1PRE_Msk         (0xFUL << RCC_CFGR1_MCO1PRE_Pos)           /*!< 0x003C0000 */
#define RCC_CFGR1_MCO1PRE             RCC_CFGR1_MCO1PRE_Msk                      /*!< MCO1 prescaler */
#define RCC_CFGR1_MCO1PRE_0           (0x1UL << RCC_CFGR1_MCO1PRE_Pos)           /*!< 0x00040000 */
#define RCC_CFGR1_MCO1PRE_1           (0x2UL << RCC_CFGR1_MCO1PRE_Pos)           /*!< 0x00080000 */
#define RCC_CFGR1_MCO1PRE_2           (0x4UL << RCC_CFGR1_MCO1PRE_Pos)           /*!< 0x00100000 */
#define RCC_CFGR1_MCO1PRE_3           (0x8UL << RCC_CFGR1_MCO1PRE_Pos)           /*!< 0x00200000 */
#define RCC_CFGR1_MCO1SEL_Pos         (22U)
#define RCC_CFGR1_MCO1SEL_Msk         (0x7UL << RCC_CFGR1_MCO1SEL_Pos)           /*!< 0x01C00000 */
#define RCC_CFGR1_MCO1SEL             RCC_CFGR1_MCO1SEL_Msk                      /*!< Microcontroller clock output 1 */
#define RCC_CFGR1_MCO1SEL_0           (0x1UL << RCC_CFGR1_MCO1SEL_Pos)           /*!< 0x00400000 */
#define RCC_CFGR1_MCO1SEL_1           (0x2UL << RCC_CFGR1_MCO1SEL_Pos)           /*!< 0x00800000 */
#define RCC_CFGR1_MCO1SEL_2           (0x4UL << RCC_CFGR1_MCO1SEL_Pos)           /*!< 0x01000000 */
#define RCC_CFGR1_MCO2PRE_Pos         (25U)
#define RCC_CFGR1_MCO2PRE_Msk         (0xFUL << RCC_CFGR1_MCO2PRE_Pos)           /*!< 0x1E000000 */
#define RCC_CFGR1_MCO2PRE             RCC_CFGR1_MCO2PRE_Msk                      /*!< MCO2 prescaler */
#define RCC_CFGR1_MCO2PRE_0           (0x1UL << RCC_CFGR1_MCO2PRE_Pos)           /*!< 0x02000000 */
#define RCC_CFGR1_MCO2PRE_1           (0x2UL << RCC_CFGR1_MCO2PRE_Pos)           /*!< 0x04000000 */
#define RCC_CFGR1_MCO2PRE_2           (0x4UL << RCC_CFGR1_MCO2PRE_Pos)           /*!< 0x08000000 */
#define RCC_CFGR1_MCO2PRE_3           (0x8UL << RCC_CFGR1_MCO2PRE_Pos)           /*!< 0x10000000 */
#define RCC_CFGR1_MCO2SEL_Pos         (29U)
#define RCC_CFGR1_MCO2SEL_Msk         (0x7UL << RCC_CFGR1_MCO2SEL_Pos)           /*!< 0xE0000000 */
#define RCC_CFGR1_MCO2SEL             RCC_CFGR1_MCO2SEL_Msk                      /*!< Microcontroller clock output 2 */
#define RCC_CFGR1_MCO2SEL_0           (0x1UL << RCC_CFGR1_MCO2SEL_Pos)           /*!< 0x20000000 */
#define RCC_CFGR1_MCO2SEL_1           (0x2UL << RCC_CFGR1_MCO2SEL_Pos)           /*!< 0x40000000 */
#define RCC_CFGR1_MCO2SEL_2           (0x4UL << RCC_CFGR1_MCO2SEL_Pos)           /*!< 0x80000000 */

/* ************************************  Bit definition for RCC_CFGR2 register  ************************************* */
#define RCC_CFGR2_Rst                 (0x00000000UL)                             /*!< RCC_CFGR2 reset value */
#define RCC_CFGR2_HPRE_Pos            (0U)
#define RCC_CFGR2_HPRE_Msk            (0xFUL << RCC_CFGR2_HPRE_Pos)              /*!< 0x0000000F */
#define RCC_CFGR2_HPRE                RCC_CFGR2_HPRE_Msk                         /*!< AHB prescaler */
#define RCC_CFGR2_HPRE_0              (0x1UL << RCC_CFGR2_HPRE_Pos)              /*!< 0x00000001 */
#define RCC_CFGR2_HPRE_1              (0x2UL << RCC_CFGR2_HPRE_Pos)              /*!< 0x00000002 */
#define RCC_CFGR2_HPRE_2              (0x4UL << RCC_CFGR2_HPRE_Pos)              /*!< 0x00000004 */
#define RCC_CFGR2_HPRE_3              (0x8UL << RCC_CFGR2_HPRE_Pos)              /*!< 0x00000008 */
#define RCC_CFGR2_PPRE1_Pos           (4U)
#define RCC_CFGR2_PPRE1_Msk           (0x7UL << RCC_CFGR2_PPRE1_Pos)             /*!< 0x00000070 */
#define RCC_CFGR2_PPRE1               RCC_CFGR2_PPRE1_Msk                        /*!< APB low-speed prescaler (APB1) */
#define RCC_CFGR2_PPRE1_0             (0x1UL << RCC_CFGR2_PPRE1_Pos)             /*!< 0x00000010 */
#define RCC_CFGR2_PPRE1_1             (0x2UL << RCC_CFGR2_PPRE1_Pos)             /*!< 0x00000020 */
#define RCC_CFGR2_PPRE1_2             (0x4UL << RCC_CFGR2_PPRE1_Pos)             /*!< 0x00000040 */
#define RCC_CFGR2_PPRE2_Pos           (8U)
#define RCC_CFGR2_PPRE2_Msk           (0x7UL << RCC_CFGR2_PPRE2_Pos)             /*!< 0x00000700 */
#define RCC_CFGR2_PPRE2               RCC_CFGR2_PPRE2_Msk                        /*!< APB high-speed prescaler (APB2) */
#define RCC_CFGR2_PPRE2_0             (0x1UL << RCC_CFGR2_PPRE2_Pos)             /*!< 0x00000100 */
#define RCC_CFGR2_PPRE2_1             (0x2UL << RCC_CFGR2_PPRE2_Pos)             /*!< 0x00000200 */
#define RCC_CFGR2_PPRE2_2             (0x4UL << RCC_CFGR2_PPRE2_Pos)             /*!< 0x00000400 */
#define RCC_CFGR2_PPRE3_Pos           (12U)
#define RCC_CFGR2_PPRE3_Msk           (0x7UL << RCC_CFGR2_PPRE3_Pos)             /*!< 0x00007000 */
#define RCC_CFGR2_PPRE3               RCC_CFGR2_PPRE3_Msk                        /*!< APB low-speed prescaler (APB3) */
#define RCC_CFGR2_PPRE3_0             (0x1UL << RCC_CFGR2_PPRE3_Pos)             /*!< 0x00001000 */
#define RCC_CFGR2_PPRE3_1             (0x2UL << RCC_CFGR2_PPRE3_Pos)             /*!< 0x00002000 */
#define RCC_CFGR2_PPRE3_2             (0x4UL << RCC_CFGR2_PPRE3_Pos)             /*!< 0x00004000 */
#define RCC_CFGR2_AHB1DIS_Pos         (16U)
#define RCC_CFGR2_AHB1DIS_Msk         (0x1UL << RCC_CFGR2_AHB1DIS_Pos)           /*!< 0x00010000 */
#define RCC_CFGR2_AHB1DIS             RCC_CFGR2_AHB1DIS_Msk                      /*!< AHB1 clock disable */
#define RCC_CFGR2_AHB2DIS_Pos         (17U)
#define RCC_CFGR2_AHB2DIS_Msk         (0x1UL << RCC_CFGR2_AHB2DIS_Pos)           /*!< 0x00020000 */
#define RCC_CFGR2_AHB2DIS             RCC_CFGR2_AHB2DIS_Msk                      /*!< AHB2 clock disable */
#define RCC_CFGR2_APB1DIS_Pos         (20U)
#define RCC_CFGR2_APB1DIS_Msk         (0x1UL << RCC_CFGR2_APB1DIS_Pos)           /*!< 0x00100000 */
#define RCC_CFGR2_APB1DIS             RCC_CFGR2_APB1DIS_Msk                      /*!< APB1 clock disable value */
#define RCC_CFGR2_APB2DIS_Pos         (21U)
#define RCC_CFGR2_APB2DIS_Msk         (0x1UL << RCC_CFGR2_APB2DIS_Pos)           /*!< 0x00200000 */
#define RCC_CFGR2_APB2DIS             RCC_CFGR2_APB2DIS_Msk                      /*!< APB2 clock disable value */
#define RCC_CFGR2_APB3DIS_Pos         (22U)
#define RCC_CFGR2_APB3DIS_Msk         (0x1UL << RCC_CFGR2_APB3DIS_Pos)           /*!< 0x00400000 */
#define RCC_CFGR2_APB3DIS             RCC_CFGR2_APB3DIS_Msk                      /*!< APB3 clock disable value.Set and
                                                                                      cleared by software */

/* *************************************  Bit definition for RCC_CIER register  ************************************* */
#define RCC_CIER_Rst                  (0x00000000UL)                             /*!< RCC_CIER reset value */
#define RCC_CIER_LSIRDYIE_Pos         (0U)
#define RCC_CIER_LSIRDYIE_Msk         (0x1UL << RCC_CIER_LSIRDYIE_Pos)           /*!< 0x00000001 */
#define RCC_CIER_LSIRDYIE             RCC_CIER_LSIRDYIE_Msk                      /*!< LSI ready interrupt enable */
#define RCC_CIER_LSERDYIE_Pos         (1U)
#define RCC_CIER_LSERDYIE_Msk         (0x1UL << RCC_CIER_LSERDYIE_Pos)           /*!< 0x00000002 */
#define RCC_CIER_LSERDYIE             RCC_CIER_LSERDYIE_Msk                      /*!< LSE ready interrupt enable */
#define RCC_CIER_HSISRDYIE_Pos        (2U)
#define RCC_CIER_HSISRDYIE_Msk        (0x1UL << RCC_CIER_HSISRDYIE_Pos)          /*!< 0x00000004 */
#define RCC_CIER_HSISRDYIE            RCC_CIER_HSISRDYIE_Msk                     /*!< HSIS ready interrupt enable */
#define RCC_CIER_HSIDIV3RDYIE_Pos     (3U)
#define RCC_CIER_HSIDIV3RDYIE_Msk     (0x1UL << RCC_CIER_HSIDIV3RDYIE_Pos)       /*!< 0x00000008 */
#define RCC_CIER_HSIDIV3RDYIE         RCC_CIER_HSIDIV3RDYIE_Msk                  /*!< HSIDIV3 ready interrupt enable */
#define RCC_CIER_HSIKRDYIE_Pos        (4U)
#define RCC_CIER_HSIKRDYIE_Msk        (0x1UL << RCC_CIER_HSIKRDYIE_Pos)          /*!< 0x00000010 */
#define RCC_CIER_HSIKRDYIE            RCC_CIER_HSIKRDYIE_Msk                     /*!< HSIK ready interrupt enable */
#define RCC_CIER_PSISRDYIE_Pos        (5U)
#define RCC_CIER_PSISRDYIE_Msk        (0x1UL << RCC_CIER_PSISRDYIE_Pos)          /*!< 0x00000020 */
#define RCC_CIER_PSISRDYIE            RCC_CIER_PSISRDYIE_Msk                     /*!< PSIS ready interrupt enable */
#define RCC_CIER_PSIDIV3RDYIE_Pos     (6U)
#define RCC_CIER_PSIDIV3RDYIE_Msk     (0x1UL << RCC_CIER_PSIDIV3RDYIE_Pos)       /*!< 0x00000040 */
#define RCC_CIER_PSIDIV3RDYIE         RCC_CIER_PSIDIV3RDYIE_Msk                  /*!< PSIDIV3 ready interrupt enable */
#define RCC_CIER_PSIKRDYIE_Pos        (7U)
#define RCC_CIER_PSIKRDYIE_Msk        (0x1UL << RCC_CIER_PSIKRDYIE_Pos)          /*!< 0x00000080 */
#define RCC_CIER_PSIKRDYIE            RCC_CIER_PSIKRDYIE_Msk                     /*!< PSIK ready interrupt enable */
#define RCC_CIER_HSERDYIE_Pos         (8U)
#define RCC_CIER_HSERDYIE_Msk         (0x1UL << RCC_CIER_HSERDYIE_Pos)           /*!< 0x00000100 */
#define RCC_CIER_HSERDYIE             RCC_CIER_HSERDYIE_Msk                      /*!< HSE ready interrupt enable */

/* *************************************  Bit definition for RCC_CIFR register  ************************************* */
#define RCC_CIFR_LSIRDYF_Pos          (0U)
#define RCC_CIFR_LSIRDYF_Msk          (0x1UL << RCC_CIFR_LSIRDYF_Pos)            /*!< 0x00000001 */
#define RCC_CIFR_LSIRDYF              RCC_CIFR_LSIRDYF_Msk                       /*!< LSI ready interrupt flag */
#define RCC_CIFR_LSERDYF_Pos          (1U)
#define RCC_CIFR_LSERDYF_Msk          (0x1UL << RCC_CIFR_LSERDYF_Pos)            /*!< 0x00000002 */
#define RCC_CIFR_LSERDYF              RCC_CIFR_LSERDYF_Msk                       /*!< LSE ready interrupt flag */
#define RCC_CIFR_HSISRDYF_Pos         (2U)
#define RCC_CIFR_HSISRDYF_Msk         (0x1UL << RCC_CIFR_HSISRDYF_Pos)           /*!< 0x00000004 */
#define RCC_CIFR_HSISRDYF             RCC_CIFR_HSISRDYF_Msk                      /*!< HSIS ready interrupt flag */
#define RCC_CIFR_HSIDIV3RDYF_Pos      (3U)
#define RCC_CIFR_HSIDIV3RDYF_Msk      (0x1UL << RCC_CIFR_HSIDIV3RDYF_Pos)        /*!< 0x00000008 */
#define RCC_CIFR_HSIDIV3RDYF          RCC_CIFR_HSIDIV3RDYF_Msk                   /*!< HSIDIV3 ready interrupt flag */
#define RCC_CIFR_HSIKRDYF_Pos         (4U)
#define RCC_CIFR_HSIKRDYF_Msk         (0x1UL << RCC_CIFR_HSIKRDYF_Pos)           /*!< 0x00000010 */
#define RCC_CIFR_HSIKRDYF             RCC_CIFR_HSIKRDYF_Msk                      /*!< HSIK ready interrupt flag */
#define RCC_CIFR_PSISRDYF_Pos         (5U)
#define RCC_CIFR_PSISRDYF_Msk         (0x1UL << RCC_CIFR_PSISRDYF_Pos)           /*!< 0x00000020 */
#define RCC_CIFR_PSISRDYF             RCC_CIFR_PSISRDYF_Msk                      /*!< PSIS ready interrupt flag */
#define RCC_CIFR_PSIDIV3RDYF_Pos      (6U)
#define RCC_CIFR_PSIDIV3RDYF_Msk      (0x1UL << RCC_CIFR_PSIDIV3RDYF_Pos)        /*!< 0x00000040 */
#define RCC_CIFR_PSIDIV3RDYF          RCC_CIFR_PSIDIV3RDYF_Msk                   /*!< PSIDIV3 ready interrupt flag */
#define RCC_CIFR_PSIKRDYF_Pos         (7U)
#define RCC_CIFR_PSIKRDYF_Msk         (0x1UL << RCC_CIFR_PSIKRDYF_Pos)           /*!< 0x00000080 */
#define RCC_CIFR_PSIKRDYF             RCC_CIFR_PSIKRDYF_Msk                      /*!< PSIK ready interrupt flag */
#define RCC_CIFR_HSERDYF_Pos          (8U)
#define RCC_CIFR_HSERDYF_Msk          (0x1UL << RCC_CIFR_HSERDYF_Pos)            /*!< 0x00000100 */
#define RCC_CIFR_HSERDYF              RCC_CIFR_HSERDYF_Msk                       /*!< HSE ready interrupt flag */
#define RCC_CIFR_HSECSSF_Pos          (10U)
#define RCC_CIFR_HSECSSF_Msk          (0x1UL << RCC_CIFR_HSECSSF_Pos)            /*!< 0x00000400 */
#define RCC_CIFR_HSECSSF              RCC_CIFR_HSECSSF_Msk                       /*!< HSE clock security system
                                                                                      interrupt flag */
#define RCC_CIFR_LSECSSF_Pos          (11U)
#define RCC_CIFR_LSECSSF_Msk          (0x1UL << RCC_CIFR_LSECSSF_Pos)            /*!< 0x00000800 */
#define RCC_CIFR_LSECSSF              RCC_CIFR_LSECSSF_Msk                       /*!< LSE clock security system
                                                                                      interrupt flag */

/* *************************************  Bit definition for RCC_CICR register  ************************************* */
#define RCC_CICR_Rst                  (0x00000000UL)                             /*!< RCC_CICR reset value */
#define RCC_CICR_LSIRDYC_Pos          (0U)
#define RCC_CICR_LSIRDYC_Msk          (0x1UL << RCC_CICR_LSIRDYC_Pos)            /*!< 0x00000001 */
#define RCC_CICR_LSIRDYC              RCC_CICR_LSIRDYC_Msk                       /*!< LSI ready interrupt clear */
#define RCC_CICR_LSERDYC_Pos          (1U)
#define RCC_CICR_LSERDYC_Msk          (0x1UL << RCC_CICR_LSERDYC_Pos)            /*!< 0x00000002 */
#define RCC_CICR_LSERDYC              RCC_CICR_LSERDYC_Msk                       /*!< LSE ready interrupt clear */
#define RCC_CICR_HSISRDYC_Pos         (2U)
#define RCC_CICR_HSISRDYC_Msk         (0x1UL << RCC_CICR_HSISRDYC_Pos)           /*!< 0x00000004 */
#define RCC_CICR_HSISRDYC             RCC_CICR_HSISRDYC_Msk                      /*!< HSIS ready interrupt clear */
#define RCC_CICR_HSIDIV3RDYC_Pos      (3U)
#define RCC_CICR_HSIDIV3RDYC_Msk      (0x1UL << RCC_CICR_HSIDIV3RDYC_Pos)        /*!< 0x00000008 */
#define RCC_CICR_HSIDIV3RDYC          RCC_CICR_HSIDIV3RDYC_Msk                   /*!< HSIDIV3 ready interrupt clear */
#define RCC_CICR_HSIKRDYC_Pos         (4U)
#define RCC_CICR_HSIKRDYC_Msk         (0x1UL << RCC_CICR_HSIKRDYC_Pos)           /*!< 0x00000010 */
#define RCC_CICR_HSIKRDYC             RCC_CICR_HSIKRDYC_Msk                      /*!< HSIK ready interrupt clear */
#define RCC_CICR_PSISRDYC_Pos         (5U)
#define RCC_CICR_PSISRDYC_Msk         (0x1UL << RCC_CICR_PSISRDYC_Pos)           /*!< 0x00000020 */
#define RCC_CICR_PSISRDYC             RCC_CICR_PSISRDYC_Msk                      /*!< PSIS ready interrupt clear */
#define RCC_CICR_PSIDIV3RDYC_Pos      (6U)
#define RCC_CICR_PSIDIV3RDYC_Msk      (0x1UL << RCC_CICR_PSIDIV3RDYC_Pos)        /*!< 0x00000040 */
#define RCC_CICR_PSIDIV3RDYC          RCC_CICR_PSIDIV3RDYC_Msk                   /*!< PSIDIV3 ready interrupt clear */
#define RCC_CICR_PSIKRDYC_Pos         (7U)
#define RCC_CICR_PSIKRDYC_Msk         (0x1UL << RCC_CICR_PSIKRDYC_Pos)           /*!< 0x00000080 */
#define RCC_CICR_PSIKRDYC             RCC_CICR_PSIKRDYC_Msk                      /*!< PSIK ready interrupt clear */
#define RCC_CICR_HSERDYC_Pos          (8U)
#define RCC_CICR_HSERDYC_Msk          (0x1UL << RCC_CICR_HSERDYC_Pos)            /*!< 0x00000100 */
#define RCC_CICR_HSERDYC              RCC_CICR_HSERDYC_Msk                       /*!< HSE ready interrupt clear */
#define RCC_CICR_HSECSSC_Pos          (10U)
#define RCC_CICR_HSECSSC_Msk          (0x1UL << RCC_CICR_HSECSSC_Pos)            /*!< 0x00000400 */
#define RCC_CICR_HSECSSC              RCC_CICR_HSECSSC_Msk                       /*!< HSE clock security system
                                                                                      interrupt clear */
#define RCC_CICR_LSECSSC_Pos          (11U)
#define RCC_CICR_LSECSSC_Msk          (0x1UL << RCC_CICR_LSECSSC_Pos)            /*!< 0x00000800 */
#define RCC_CICR_LSECSSC              RCC_CICR_LSECSSC_Msk                       /*!< LSE clock security system
                                                                                      interrupt clear */

/* ***********************************  Bit definition for RCC_AHB1RSTR register  *********************************** */
#define RCC_AHB1RSTR_Rst              (0x00000000UL)                             /*!< RCC_AHB1RSTR reset value */
#define RCC_AHB1RSTR_LPDMA1RST_Pos    (0U)
#define RCC_AHB1RSTR_LPDMA1RST_Msk    (0x1UL << RCC_AHB1RSTR_LPDMA1RST_Pos)      /*!< 0x00000001 */
#define RCC_AHB1RSTR_LPDMA1RST        RCC_AHB1RSTR_LPDMA1RST_Msk                 /*!< LPDMA1 reset */
#define RCC_AHB1RSTR_LPDMA2RST_Pos    (1U)
#define RCC_AHB1RSTR_LPDMA2RST_Msk    (0x1UL << RCC_AHB1RSTR_LPDMA2RST_Pos)      /*!< 0x00000002 */
#define RCC_AHB1RSTR_LPDMA2RST        RCC_AHB1RSTR_LPDMA2RST_Msk                 /*!< LPDMA2 reset */
#define RCC_AHB1RSTR_CRCRST_Pos       (12U)
#define RCC_AHB1RSTR_CRCRST_Msk       (0x1UL << RCC_AHB1RSTR_CRCRST_Pos)         /*!< 0x00001000 */
#define RCC_AHB1RSTR_CRCRST           RCC_AHB1RSTR_CRCRST_Msk                    /*!< CRC reset */
#define RCC_AHB1RSTR_CORDICRST_Pos    (14U)
#define RCC_AHB1RSTR_CORDICRST_Msk    (0x1UL << RCC_AHB1RSTR_CORDICRST_Pos)      /*!< 0x00004000 */
#define RCC_AHB1RSTR_CORDICRST        RCC_AHB1RSTR_CORDICRST_Msk                 /*!< CORDIC reset */
#define RCC_AHB1RSTR_RAMCFGRST_Pos    (17U)
#define RCC_AHB1RSTR_RAMCFGRST_Msk    (0x1UL << RCC_AHB1RSTR_RAMCFGRST_Pos)      /*!< 0x00020000 */
#define RCC_AHB1RSTR_RAMCFGRST        RCC_AHB1RSTR_RAMCFGRST_Msk                 /*!< RAMCFG reset */

