MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c532xx.h
/* ***********************************  Bit definition for RCC_APB1HENR register  *********************************** */
#define RCC_APB1HENR_Rst              (0x00000000UL)                             /*!< RCC_APB1HENR reset value */
#define RCC_APB1HENR_COMP12EN_Pos     (3U)
#define RCC_APB1HENR_COMP12EN_Msk     (0x1UL << RCC_APB1HENR_COMP12EN_Pos)       /*!< 0x00000008 */
#define RCC_APB1HENR_COMP12EN         RCC_APB1HENR_COMP12EN_Msk                  /*!< COMP1 and COMP2 clock enable */
#define RCC_APB1HENR_FDCANEN_Pos      (9U)
#define RCC_APB1HENR_FDCANEN_Msk      (0x1UL << RCC_APB1HENR_FDCANEN_Pos)        /*!< 0x00000200 */
#define RCC_APB1HENR_FDCANEN          RCC_APB1HENR_FDCANEN_Msk                   /*!< FDCAN1 clock enable */

/* ***********************************  Bit definition for RCC_APB2ENR register  ************************************ */
#define RCC_APB2ENR_Rst               (0x00000000UL)                             /*!< RCC_APB2ENR reset value */
#define RCC_APB2ENR_TIM1EN_Pos        (11U)
#define RCC_APB2ENR_TIM1EN_Msk        (0x1UL << RCC_APB2ENR_TIM1EN_Pos)          /*!< 0x00000800 */
#define RCC_APB2ENR_TIM1EN            RCC_APB2ENR_TIM1EN_Msk                     /*!< TIM1 clock enable */
#define RCC_APB2ENR_SPI1EN_Pos        (12U)
#define RCC_APB2ENR_SPI1EN_Msk        (0x1UL << RCC_APB2ENR_SPI1EN_Pos)          /*!< 0x00001000 */
#define RCC_APB2ENR_SPI1EN            RCC_APB2ENR_SPI1EN_Msk                     /*!< SPI1 clock enable */
#define RCC_APB2ENR_TIM8EN_Pos        (13U)
#define RCC_APB2ENR_TIM8EN_Msk        (0x1UL << RCC_APB2ENR_TIM8EN_Pos)          /*!< 0x00002000 */
#define RCC_APB2ENR_TIM8EN            RCC_APB2ENR_TIM8EN_Msk                     /*!< TIM8 clock enable */
#define RCC_APB2ENR_USART1EN_Pos      (14U)
#define RCC_APB2ENR_USART1EN_Msk      (0x1UL << RCC_APB2ENR_USART1EN_Pos)        /*!< 0x00004000 */
#define RCC_APB2ENR_USART1EN          RCC_APB2ENR_USART1EN_Msk                   /*!< USART1 clock enable */
#define RCC_APB2ENR_TIM15EN_Pos       (16U)
#define RCC_APB2ENR_TIM15EN_Msk       (0x1UL << RCC_APB2ENR_TIM15EN_Pos)         /*!< 0x00010000 */
#define RCC_APB2ENR_TIM15EN           RCC_APB2ENR_TIM15EN_Msk                    /*!< TIM15 clock enable */
#define RCC_APB2ENR_USBEN_Pos         (24U)
#define RCC_APB2ENR_USBEN_Msk         (0x1UL << RCC_APB2ENR_USBEN_Pos)           /*!< 0x01000000 */
#define RCC_APB2ENR_USBEN             RCC_APB2ENR_USBEN_Msk                      /*!< USBEN (USB clock enable) */

/* ***********************************  Bit definition for RCC_APB3ENR register  ************************************ */
#define RCC_APB3ENR_Rst               (0x00000000UL)                             /*!< RCC_APB3ENR reset value */
#define RCC_APB3ENR_SBSEN_Pos         (1U)
#define RCC_APB3ENR_SBSEN_Msk         (0x1UL << RCC_APB3ENR_SBSEN_Pos)           /*!< 0x00000002 */
#define RCC_APB3ENR_SBSEN             RCC_APB3ENR_SBSEN_Msk                      /*!< SBS clock enable */
#define RCC_APB3ENR_LPUART1EN_Pos     (6U)
#define RCC_APB3ENR_LPUART1EN_Msk     (0x1UL << RCC_APB3ENR_LPUART1EN_Pos)       /*!< 0x00000040 */
#define RCC_APB3ENR_LPUART1EN         RCC_APB3ENR_LPUART1EN_Msk                  /*!< LPUART1 clock enable */
#define RCC_APB3ENR_LPTIM1EN_Pos      (11U)
#define RCC_APB3ENR_LPTIM1EN_Msk      (0x1UL << RCC_APB3ENR_LPTIM1EN_Pos)        /*!< 0x00000800 */
#define RCC_APB3ENR_LPTIM1EN          RCC_APB3ENR_LPTIM1EN_Msk                   /*!< LPTIM1EN (LPTIM1 clock enable) */
#define RCC_APB3ENR_RTCAPBEN_Pos      (21U)
#define RCC_APB3ENR_RTCAPBEN_Msk      (0x1UL << RCC_APB3ENR_RTCAPBEN_Pos)        /*!< 0x00200000 */
#define RCC_APB3ENR_RTCAPBEN          RCC_APB3ENR_RTCAPBEN_Msk                   /*!< RTC APB interface clock enable */

/* **********************************  Bit definition for RCC_AHB1LPENR register  *********************************** */
#define RCC_AHB1LPENR_Rst             (0xC4025103UL)                             /*!< RCC_AHB1LPENR reset value */
#define RCC_AHB1LPENR_LPDMA1LPEN_Pos  (0U)
#define RCC_AHB1LPENR_LPDMA1LPEN_Msk  (0x1UL << RCC_AHB1LPENR_LPDMA1LPEN_Pos)    /*!< 0x00000001 */
#define RCC_AHB1LPENR_LPDMA1LPEN      RCC_AHB1LPENR_LPDMA1LPEN_Msk               /*!< LPDMA1 clock enable during Sleep
                                                                                      mode */
#define RCC_AHB1LPENR_LPDMA2LPEN_Pos  (1U)
#define RCC_AHB1LPENR_LPDMA2LPEN_Msk  (0x1UL << RCC_AHB1LPENR_LPDMA2LPEN_Pos)    /*!< 0x00000002 */
#define RCC_AHB1LPENR_LPDMA2LPEN      RCC_AHB1LPENR_LPDMA2LPEN_Msk               /*!< LPDMA2 clock enable during Sleep
                                                                                      mode */
#define RCC_AHB1LPENR_FLASHLPEN_Pos   (8U)
#define RCC_AHB1LPENR_FLASHLPEN_Msk   (0x1UL << RCC_AHB1LPENR_FLASHLPEN_Pos)     /*!< 0x00000100 */
#define RCC_AHB1LPENR_FLASHLPEN       RCC_AHB1LPENR_FLASHLPEN_Msk                /*!< Flash interface clock enable
                                                                                      during Sleep mode */
#define RCC_AHB1LPENR_CRCLPEN_Pos     (12U)
#define RCC_AHB1LPENR_CRCLPEN_Msk     (0x1UL << RCC_AHB1LPENR_CRCLPEN_Pos)       /*!< 0x00001000 */
#define RCC_AHB1LPENR_CRCLPEN         RCC_AHB1LPENR_CRCLPEN_Msk                  /*!< CRC clock enable during Sleep mode
                                                                                      */
#define RCC_AHB1LPENR_CORDICLPEN_Pos  (14U)
#define RCC_AHB1LPENR_CORDICLPEN_Msk  (0x1UL << RCC_AHB1LPENR_CORDICLPEN_Pos)    /*!< 0x00004000 */
#define RCC_AHB1LPENR_CORDICLPEN      RCC_AHB1LPENR_CORDICLPEN_Msk               /*!< CORDIC clock enable during Sleep
                                                                                      mode */
#define RCC_AHB1LPENR_RAMCFGLPEN_Pos  (17U)
#define RCC_AHB1LPENR_RAMCFGLPEN_Msk  (0x1UL << RCC_AHB1LPENR_RAMCFGLPEN_Pos)    /*!< 0x00020000 */
#define RCC_AHB1LPENR_RAMCFGLPEN      RCC_AHB1LPENR_RAMCFGLPEN_Msk               /*!< RAMCFG clock enable during Sleep
                                                                                      mode */
#define RCC_AHB1LPENR_ICACHELPEN_Pos  (26U)
#define RCC_AHB1LPENR_ICACHELPEN_Msk  (0x1UL << RCC_AHB1LPENR_ICACHELPEN_Pos)    /*!< 0x04000000 */
#define RCC_AHB1LPENR_ICACHELPEN      RCC_AHB1LPENR_ICACHELPEN_Msk               /*!< ICACHE clock enable during Sleep
                                                                                      mode */
#define RCC_AHB1LPENR_SRAM2LPEN_Pos   (30U)
#define RCC_AHB1LPENR_SRAM2LPEN_Msk   (0x1UL << RCC_AHB1LPENR_SRAM2LPEN_Pos)     /*!< 0x40000000 */
#define RCC_AHB1LPENR_SRAM2LPEN       RCC_AHB1LPENR_SRAM2LPEN_Msk                /*!< SRAM2 clock enable during Sleep
                                                                                      mode */
#define RCC_AHB1LPENR_SRAM1LPEN_Pos   (31U)
#define RCC_AHB1LPENR_SRAM1LPEN_Msk   (0x1UL << RCC_AHB1LPENR_SRAM1LPEN_Pos)     /*!< 0x80000000 */
#define RCC_AHB1LPENR_SRAM1LPEN       RCC_AHB1LPENR_SRAM1LPEN_Msk                /*!< SRAM1 clock enable during Sleep
                                                                                      mode */

/* **********************************  Bit definition for RCC_AHB2LPENR register  *********************************** */
#define RCC_AHB2LPENR_Rst             (0x00070C9FUL)                             /*!< RCC_AHB2LPENR reset value */
#define RCC_AHB2LPENR_GPIOALPEN_Pos   (0U)
#define RCC_AHB2LPENR_GPIOALPEN_Msk   (0x1UL << RCC_AHB2LPENR_GPIOALPEN_Pos)     /*!< 0x00000001 */
#define RCC_AHB2LPENR_GPIOALPEN       RCC_AHB2LPENR_GPIOALPEN_Msk                /*!< GPIOA clock enable during Sleep
                                                                                      mode */
#define RCC_AHB2LPENR_GPIOBLPEN_Pos   (1U)
#define RCC_AHB2LPENR_GPIOBLPEN_Msk   (0x1UL << RCC_AHB2LPENR_GPIOBLPEN_Pos)     /*!< 0x00000002 */
#define RCC_AHB2LPENR_GPIOBLPEN       RCC_AHB2LPENR_GPIOBLPEN_Msk                /*!< GPIOB clock enable during Sleep
                                                                                      mode */
#define RCC_AHB2LPENR_GPIOCLPEN_Pos   (2U)
#define RCC_AHB2LPENR_GPIOCLPEN_Msk   (0x1UL << RCC_AHB2LPENR_GPIOCLPEN_Pos)     /*!< 0x00000004 */
#define RCC_AHB2LPENR_GPIOCLPEN       RCC_AHB2LPENR_GPIOCLPEN_Msk                /*!< GPIOC clock enable during Sleep
                                                                                      mode */
#define RCC_AHB2LPENR_GPIODLPEN_Pos   (3U)
#define RCC_AHB2LPENR_GPIODLPEN_Msk   (0x1UL << RCC_AHB2LPENR_GPIODLPEN_Pos)     /*!< 0x00000008 */
#define RCC_AHB2LPENR_GPIODLPEN       RCC_AHB2LPENR_GPIODLPEN_Msk                /*!< GPIOD clock enable during Sleep
                                                                                      mode */
#define RCC_AHB2LPENR_GPIOELPEN_Pos   (4U)
#define RCC_AHB2LPENR_GPIOELPEN_Msk   (0x1UL << RCC_AHB2LPENR_GPIOELPEN_Pos)     /*!< 0x00000010 */
#define RCC_AHB2LPENR_GPIOELPEN       RCC_AHB2LPENR_GPIOELPEN_Msk                /*!< GPIOE clock enable during Sleep
                                                                                      mode */
#define RCC_AHB2LPENR_GPIOHLPEN_Pos   (7U)
#define RCC_AHB2LPENR_GPIOHLPEN_Msk   (0x1UL << RCC_AHB2LPENR_GPIOHLPEN_Pos)     /*!< 0x00000080 */
#define RCC_AHB2LPENR_GPIOHLPEN       RCC_AHB2LPENR_GPIOHLPEN_Msk                /*!< GPIOH clock enable during Sleep
                                                                                      mode */
#define RCC_AHB2LPENR_ADC12LPEN_Pos   (10U)
#define RCC_AHB2LPENR_ADC12LPEN_Msk   (0x1UL << RCC_AHB2LPENR_ADC12LPEN_Pos)     /*!< 0x00000400 */
#define RCC_AHB2LPENR_ADC12LPEN       RCC_AHB2LPENR_ADC12LPEN_Msk                /*!< ADC1 and ADC2 clock enable during
                                                                                      Sleep mode */
#define RCC_AHB2LPENR_DAC1LPEN_Pos    (11U)
#define RCC_AHB2LPENR_DAC1LPEN_Msk    (0x1UL << RCC_AHB2LPENR_DAC1LPEN_Pos)      /*!< 0x00000800 */
#define RCC_AHB2LPENR_DAC1LPEN        RCC_AHB2LPENR_DAC1LPEN_Msk                 /*!< DAC1 clock enable during Sleep
                                                                                      mode */
#define RCC_AHB2LPENR_HASHLPEN_Pos    (17U)
#define RCC_AHB2LPENR_HASHLPEN_Msk    (0x1UL << RCC_AHB2LPENR_HASHLPEN_Pos)      /*!< 0x00020000 */
#define RCC_AHB2LPENR_HASHLPEN        RCC_AHB2LPENR_HASHLPEN_Msk                 /*!< HASH clock enable during Sleep
                                                                                      mode */
#define RCC_AHB2LPENR_RNGLPEN_Pos     (18U)
#define RCC_AHB2LPENR_RNGLPEN_Msk     (0x1UL << RCC_AHB2LPENR_RNGLPEN_Pos)       /*!< 0x00040000 */
#define RCC_AHB2LPENR_RNGLPEN         RCC_AHB2LPENR_RNGLPEN_Msk                  /*!< RNG clock enable during Sleep mode
                                                                                      */

/* **********************************  Bit definition for RCC_APB1LLPENR register  ********************************** */
#define RCC_APB1LLPENR_Rst            (0x01BA6859UL)                             /*!< RCC_APB1LLPENR reset value */
#define RCC_APB1LLPENR_TIM2LPEN_Pos   (0U)
#define RCC_APB1LLPENR_TIM2LPEN_Msk   (0x1UL << RCC_APB1LLPENR_TIM2LPEN_Pos)     /*!< 0x00000001 */
#define RCC_APB1LLPENR_TIM2LPEN       RCC_APB1LLPENR_TIM2LPEN_Msk                /*!< TIM2 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_TIM6LPEN_Pos   (4U)
#define RCC_APB1LLPENR_TIM6LPEN_Msk   (0x1UL << RCC_APB1LLPENR_TIM6LPEN_Pos)     /*!< 0x00000010 */
#define RCC_APB1LLPENR_TIM6LPEN       RCC_APB1LLPENR_TIM6LPEN_Msk                /*!< TIM6 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_TIM7LPEN_Pos   (5U)
#define RCC_APB1LLPENR_TIM7LPEN_Msk   (0x1UL << RCC_APB1LLPENR_TIM7LPEN_Pos)     /*!< 0x00000020 */
#define RCC_APB1LLPENR_TIM7LPEN       RCC_APB1LLPENR_TIM7LPEN_Msk                /*!< TIM7 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_TIM12LPEN_Pos  (6U)
#define RCC_APB1LLPENR_TIM12LPEN_Msk  (0x1UL << RCC_APB1LLPENR_TIM12LPEN_Pos)    /*!< 0x00000040 */
#define RCC_APB1LLPENR_TIM12LPEN      RCC_APB1LLPENR_TIM12LPEN_Msk               /*!< TIM12 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_WWDGLPEN_Pos   (11U)
#define RCC_APB1LLPENR_WWDGLPEN_Msk   (0x1UL << RCC_APB1LLPENR_WWDGLPEN_Pos)     /*!< 0x00000800 */
#define RCC_APB1LLPENR_WWDGLPEN       RCC_APB1LLPENR_WWDGLPEN_Msk                /*!< WWDG clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_OPAMP1LPEN_Pos (13U)
#define RCC_APB1LLPENR_OPAMP1LPEN_Msk (0x1UL << RCC_APB1LLPENR_OPAMP1LPEN_Pos)   /*!< 0x00002000 */
#define RCC_APB1LLPENR_OPAMP1LPEN     RCC_APB1LLPENR_OPAMP1LPEN_Msk              /*!< OPAMP1 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_SPI2LPEN_Pos   (14U)
#define RCC_APB1LLPENR_SPI2LPEN_Msk   (0x1UL << RCC_APB1LLPENR_SPI2LPEN_Pos)     /*!< 0x00004000 */
#define RCC_APB1LLPENR_SPI2LPEN       RCC_APB1LLPENR_SPI2LPEN_Msk                /*!< SPI2 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_USART2LPEN_Pos (17U)
#define RCC_APB1LLPENR_USART2LPEN_Msk (0x1UL << RCC_APB1LLPENR_USART2LPEN_Pos)   /*!< 0x00020000 */
#define RCC_APB1LLPENR_USART2LPEN     RCC_APB1LLPENR_USART2LPEN_Msk              /*!< USART2 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_UART4LPEN_Pos  (19U)
#define RCC_APB1LLPENR_UART4LPEN_Msk  (0x1UL << RCC_APB1LLPENR_UART4LPEN_Pos)    /*!< 0x00080000 */
#define RCC_APB1LLPENR_UART4LPEN      RCC_APB1LLPENR_UART4LPEN_Msk               /*!< UART4 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_UART5LPEN_Pos  (20U)
#define RCC_APB1LLPENR_UART5LPEN_Msk  (0x1UL << RCC_APB1LLPENR_UART5LPEN_Pos)    /*!< 0x00100000 */
#define RCC_APB1LLPENR_UART5LPEN      RCC_APB1LLPENR_UART5LPEN_Msk               /*!< UART5 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_I2C1LPEN_Pos   (21U)
#define RCC_APB1LLPENR_I2C1LPEN_Msk   (0x1UL << RCC_APB1LLPENR_I2C1LPEN_Pos)     /*!< 0x00200000 */
#define RCC_APB1LLPENR_I2C1LPEN       RCC_APB1LLPENR_I2C1LPEN_Msk                /*!< I2C1 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_I3C1LPEN_Pos   (23U)
#define RCC_APB1LLPENR_I3C1LPEN_Msk   (0x1UL << RCC_APB1LLPENR_I3C1LPEN_Pos)     /*!< 0x00800000 */
#define RCC_APB1LLPENR_I3C1LPEN       RCC_APB1LLPENR_I3C1LPEN_Msk                /*!< I3C1 clock enable during Sleep
                                                                                      mode */
#define RCC_APB1LLPENR_CRSLPEN_Pos    (24U)
#define RCC_APB1LLPENR_CRSLPEN_Msk    (0x1UL << RCC_APB1LLPENR_CRSLPEN_Pos)      /*!< 0x01000000 */
#define RCC_APB1LLPENR_CRSLPEN        RCC_APB1LLPENR_CRSLPEN_Msk                 /*!< CRS clock enable during Sleep mode
                                                                                      */

/* **********************************  Bit definition for RCC_APB1HLPENR register  ********************************** */
#define RCC_APB1HLPENR_Rst            (0x40000208UL)                             /*!< RCC_APB1HLPENR reset value */
#define RCC_APB1HLPENR_COMP12LPEN_Pos (3U)
#define RCC_APB1HLPENR_COMP12LPEN_Msk (0x1UL << RCC_APB1HLPENR_COMP12LPEN_Pos)   /*!< 0x00000008 */
#define RCC_APB1HLPENR_COMP12LPEN     RCC_APB1HLPENR_COMP12LPEN_Msk              /*!< COMP1 and COMP2 clock enable
                                                                                      during Sleep mode */
#define RCC_APB1HLPENR_FDCANLPEN_Pos  (9U)
#define RCC_APB1HLPENR_FDCANLPEN_Msk  (0x1UL << RCC_APB1HLPENR_FDCANLPEN_Pos)    /*!< 0x00000200 */
#define RCC_APB1HLPENR_FDCANLPEN      RCC_APB1HLPENR_FDCANLPEN_Msk               /*!< FDCAN1 clock enable during Sleep
                                                                                      mode */

/* **********************************  Bit definition for RCC_APB2LPENR register  *********************************** */
#define RCC_APB2LPENR_Rst             (0x01077800UL)                             /*!< RCC_APB2LPENR reset value */
#define RCC_APB2LPENR_TIM1LPEN_Pos    (11U)
#define RCC_APB2LPENR_TIM1LPEN_Msk    (0x1UL << RCC_APB2LPENR_TIM1LPEN_Pos)      /*!< 0x00000800 */
#define RCC_APB2LPENR_TIM1LPEN        RCC_APB2LPENR_TIM1LPEN_Msk                 /*!< TIM1 clock enable during Sleep
                                                                                      mode */
#define RCC_APB2LPENR_SPI1LPEN_Pos    (12U)
#define RCC_APB2LPENR_SPI1LPEN_Msk    (0x1UL << RCC_APB2LPENR_SPI1LPEN_Pos)      /*!< 0x00001000 */
#define RCC_APB2LPENR_SPI1LPEN        RCC_APB2LPENR_SPI1LPEN_Msk                 /*!< SPI1 clock enable during Sleep
                                                                                      mode */
#define RCC_APB2LPENR_TIM8LPEN_Pos    (13U)
#define RCC_APB2LPENR_TIM8LPEN_Msk    (0x1UL << RCC_APB2LPENR_TIM8LPEN_Pos)      /*!< 0x00002000 */
#define RCC_APB2LPENR_TIM8LPEN        RCC_APB2LPENR_TIM8LPEN_Msk                 /*!< TIM8 clock enable during Sleep
                                                                                      mode */
#define RCC_APB2LPENR_USART1LPEN_Pos  (14U)
#define RCC_APB2LPENR_USART1LPEN_Msk  (0x1UL << RCC_APB2LPENR_USART1LPEN_Pos)    /*!< 0x00004000 */
#define RCC_APB2LPENR_USART1LPEN      RCC_APB2LPENR_USART1LPEN_Msk               /*!< USART1 clock enable during Sleep
                                                                                      mode */
#define RCC_APB2LPENR_TIM15LPEN_Pos   (16U)
#define RCC_APB2LPENR_TIM15LPEN_Msk   (0x1UL << RCC_APB2LPENR_TIM15LPEN_Pos)     /*!< 0x00010000 */
#define RCC_APB2LPENR_TIM15LPEN       RCC_APB2LPENR_TIM15LPEN_Msk                /*!< TIM15 clock enable during Sleep
                                                                                      mode */
#define RCC_APB2LPENR_USBLPEN_Pos     (24U)
#define RCC_APB2LPENR_USBLPEN_Msk     (0x1UL << RCC_APB2LPENR_USBLPEN_Pos)       /*!< 0x01000000 */
#define RCC_APB2LPENR_USBLPEN         RCC_APB2LPENR_USBLPEN_Msk                  /*!< USBLPEN (USB clock enable during
                                                                                      Sleep mode) */

/* **********************************  Bit definition for RCC_APB3LPENR register  *********************************** */
#define RCC_APB3LPENR_Rst             (0x00200842UL)                             /*!< RCC_APB3LPENR reset value */
#define RCC_APB3LPENR_SBSLPEN_Pos     (1U)
#define RCC_APB3LPENR_SBSLPEN_Msk     (0x1UL << RCC_APB3LPENR_SBSLPEN_Pos)       /*!< 0x00000002 */
#define RCC_APB3LPENR_SBSLPEN         RCC_APB3LPENR_SBSLPEN_Msk                  /*!< SBS clock enable during Sleep mode
                                                                                      */
#define RCC_APB3LPENR_LPUART1LPEN_Pos (6U)
#define RCC_APB3LPENR_LPUART1LPEN_Msk (0x1UL << RCC_APB3LPENR_LPUART1LPEN_Pos)   /*!< 0x00000040 */
#define RCC_APB3LPENR_LPUART1LPEN     RCC_APB3LPENR_LPUART1LPEN_Msk              /*!< LPUART1 clock enable during Sleep
                                                                                      mode */
#define RCC_APB3LPENR_LPTIM1LPEN_Pos  (11U)
#define RCC_APB3LPENR_LPTIM1LPEN_Msk  (0x1UL << RCC_APB3LPENR_LPTIM1LPEN_Pos)    /*!< 0x00000800 */
#define RCC_APB3LPENR_LPTIM1LPEN      RCC_APB3LPENR_LPTIM1LPEN_Msk               /*!< LPTIM1LPEN (LPTIM1 clock enable
                                                                                      during Sleep mode) */
#define RCC_APB3LPENR_RTCAPBLPEN_Pos  (21U)
#define RCC_APB3LPENR_RTCAPBLPEN_Msk  (0x1UL << RCC_APB3LPENR_RTCAPBLPEN_Pos)    /*!< 0x00200000 */
#define RCC_APB3LPENR_RTCAPBLPEN      RCC_APB3LPENR_RTCAPBLPEN_Msk               /*!< RTC APB interface clock enable
                                                                                      during Sleep mode */

