MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c532xx.h
/********************  Bits definition for RTC_ALRMBSSR register  *************/
#define RTC_ALRMBSSR_SS_Pos                 (0U)
#define RTC_ALRMBSSR_SS_Msk                 (0x7FFFUL << RTC_ALRMBSSR_SS_Pos)       /*!< 0x00007FFF */
#define RTC_ALRMBSSR_SS                     RTC_ALRMBSSR_SS_Msk                     /*!< Subseconds value */
#define RTC_ALRMBSSR_MASKSS_Pos             (24U)
#define RTC_ALRMBSSR_MASKSS_Msk             (0x3FUL << RTC_ALRMBSSR_MASKSS_Pos)     /*!< 0x3F000000 */
#define RTC_ALRMBSSR_MASKSS                 RTC_ALRMBSSR_MASKSS_Msk                 /*!< Mask the most-significant bits starting at this bit */
#define RTC_ALRMBSSR_MASKSS_0               (0x1UL << RTC_ALRMBSSR_MASKSS_Pos)      /*!< 0x01000000 */
#define RTC_ALRMBSSR_MASKSS_1               (0x2UL << RTC_ALRMBSSR_MASKSS_Pos)      /*!< 0x02000000 */
#define RTC_ALRMBSSR_MASKSS_2               (0x4UL << RTC_ALRMBSSR_MASKSS_Pos)      /*!< 0x04000000 */
#define RTC_ALRMBSSR_MASKSS_3               (0x8UL << RTC_ALRMBSSR_MASKSS_Pos)      /*!< 0x08000000 */
#define RTC_ALRMBSSR_MASKSS_4               (0x10UL << RTC_ALRMBSSR_MASKSS_Pos)     /*!< 0x10000000 */
#define RTC_ALRMBSSR_MASKSS_5               (0x20UL << RTC_ALRMBSSR_MASKSS_Pos)     /*!< 0x20000000 */
#define RTC_ALRMBSSR_SSCLR_Pos              (31U)
#define RTC_ALRMBSSR_SSCLR_Msk              (0x1UL << RTC_ALRMBSSR_SSCLR_Pos)       /*!< 0x80000000 */
#define RTC_ALRMBSSR_SSCLR                  RTC_ALRMBSSR_SSCLR_Msk                  /*!< Clear synchronous counter on alarm (Binary mode only) */

/********************  Bits definition for RTC_SR register  *******************/
#define RTC_SR_ALRAF_Pos                    (0U)
#define RTC_SR_ALRAF_Msk                    (0x1UL << RTC_SR_ALRAF_Pos)             /*!< 0x00000001 */
#define RTC_SR_ALRAF                        RTC_SR_ALRAF_Msk                        /*!< Alarm A flag */
#define RTC_SR_ALRBF_Pos                    (1U)
#define RTC_SR_ALRBF_Msk                    (0x1UL << RTC_SR_ALRBF_Pos)             /*!< 0x00000002 */
#define RTC_SR_ALRBF                        RTC_SR_ALRBF_Msk                        /*!< Alarm B flag */
#define RTC_SR_WUTF_Pos                     (2U)
#define RTC_SR_WUTF_Msk                     (0x1UL << RTC_SR_WUTF_Pos)              /*!< 0x00000004 */
#define RTC_SR_WUTF                         RTC_SR_WUTF_Msk                         /*!< Wake-up timer flag */
#define RTC_SR_TSF_Pos                      (3U)
#define RTC_SR_TSF_Msk                      (0x1UL << RTC_SR_TSF_Pos)               /*!< 0x00000008 */
#define RTC_SR_TSF                          RTC_SR_TSF_Msk                          /*!< Timestamp flag */
#define RTC_SR_TSOVF_Pos                    (4U)
#define RTC_SR_TSOVF_Msk                    (0x1UL << RTC_SR_TSOVF_Pos)             /*!< 0x00000010 */
#define RTC_SR_TSOVF                        RTC_SR_TSOVF_Msk                        /*!< Timestamp overflow flag */
#define RTC_SR_ITSF_Pos                     (5U)
#define RTC_SR_ITSF_Msk                     (0x1UL << RTC_SR_ITSF_Pos)              /*!< 0x00000020 */
#define RTC_SR_ITSF                         RTC_SR_ITSF_Msk
#define RTC_SR_SSRUF_Pos                    (6U)
#define RTC_SR_SSRUF_Msk                    (0x1UL << RTC_SR_SSRUF_Pos)             /*!< 0x00000040 */
#define RTC_SR_SSRUF                        RTC_SR_SSRUF_Msk                        /*!< SSR underflow flag */

/********************  Bits definition for RTC_MISR register  *****************/
#define RTC_MISR_ALRAMF_Pos                 (0U)
#define RTC_MISR_ALRAMF_Msk                 (0x1UL << RTC_MISR_ALRAMF_Pos)          /*!< 0x00000001 */
#define RTC_MISR_ALRAMF                     RTC_MISR_ALRAMF_Msk                     /*!< Alarm A masked flag */
#define RTC_MISR_ALRBMF_Pos                 (1U)
#define RTC_MISR_ALRBMF_Msk                 (0x1UL << RTC_MISR_ALRBMF_Pos)          /*!< 0x00000002 */
#define RTC_MISR_ALRBMF                     RTC_MISR_ALRBMF_Msk                     /*!< Alarm B masked flag */
#define RTC_MISR_WUTMF_Pos                  (2U)
#define RTC_MISR_WUTMF_Msk                  (0x1UL << RTC_MISR_WUTMF_Pos)           /*!< 0x00000004 */
#define RTC_MISR_WUTMF                      RTC_MISR_WUTMF_Msk                      /*!< Wake-up timer masked flag */
#define RTC_MISR_TSMF_Pos                   (3U)
#define RTC_MISR_TSMF_Msk                   (0x1UL << RTC_MISR_TSMF_Pos)            /*!< 0x00000008 */
#define RTC_MISR_TSMF                       RTC_MISR_TSMF_Msk                       /*!< Timestamp masked flag */
#define RTC_MISR_TSOVMF_Pos                 (4U)
#define RTC_MISR_TSOVMF_Msk                 (0x1UL << RTC_MISR_TSOVMF_Pos)          /*!< 0x00000010 */
#define RTC_MISR_TSOVMF                     RTC_MISR_TSOVMF_Msk                     /*!< Timestamp overflow masked flag */
#define RTC_MISR_ITSMF_Pos                  (5U)
#define RTC_MISR_ITSMF_Msk                  (0x1UL << RTC_MISR_ITSMF_Pos)           /*!< 0x00000020 */
#define RTC_MISR_ITSMF                      RTC_MISR_ITSMF_Msk
#define RTC_MISR_SSRUMF_Pos                 (6U)
#define RTC_MISR_SSRUMF_Msk                 (0x1UL << RTC_MISR_SSRUMF_Pos)          /*!< 0x00000040 */
#define RTC_MISR_SSRUMF                     RTC_MISR_SSRUMF_Msk                     /*!< SSR underflow masked flag */

/********************  Bits definition for RTC_SCR register  ******************/
#define RTC_SCR_CALRAF_Pos                  (0U)
#define RTC_SCR_CALRAF_Msk                  (0x1UL << RTC_SCR_CALRAF_Pos)           /*!< 0x00000001 */
#define RTC_SCR_CALRAF                      RTC_SCR_CALRAF_Msk                      /*!< Clear alarm A flag */
#define RTC_SCR_CALRBF_Pos                  (1U)
#define RTC_SCR_CALRBF_Msk                  (0x1UL << RTC_SCR_CALRBF_Pos)           /*!< 0x00000002 */
#define RTC_SCR_CALRBF                      RTC_SCR_CALRBF_Msk                      /*!< Clear alarm B flag */
#define RTC_SCR_CWUTF_Pos                   (2U)
#define RTC_SCR_CWUTF_Msk                   (0x1UL << RTC_SCR_CWUTF_Pos)            /*!< 0x00000004 */
#define RTC_SCR_CWUTF                       RTC_SCR_CWUTF_Msk                       /*!< Clear wake-up timer flag */
#define RTC_SCR_CTSF_Pos                    (3U)
#define RTC_SCR_CTSF_Msk                    (0x1UL << RTC_SCR_CTSF_Pos)             /*!< 0x00000008 */
#define RTC_SCR_CTSF                        RTC_SCR_CTSF_Msk                        /*!< Clear timestamp flag */
#define RTC_SCR_CTSOVF_Pos                  (4U)
#define RTC_SCR_CTSOVF_Msk                  (0x1UL << RTC_SCR_CTSOVF_Pos)           /*!< 0x00000010 */
#define RTC_SCR_CTSOVF                      RTC_SCR_CTSOVF_Msk                      /*!< Clear timestamp overflow flag */
#define RTC_SCR_CITSF_Pos                   (5U)
#define RTC_SCR_CITSF_Msk                   (0x1UL << RTC_SCR_CITSF_Pos)            /*!< 0x00000020 */
#define RTC_SCR_CITSF                       RTC_SCR_CITSF_Msk                       /*!< Clear timestamp overflow flag */
#define RTC_SCR_CSSRUF_Pos                  (6U)
#define RTC_SCR_CSSRUF_Msk                  (0x1UL << RTC_SCR_CSSRUF_Pos)           /*!< 0x00000040 */
#define RTC_SCR_CSSRUF                      RTC_SCR_CSSRUF_Msk                      /*!< Clear SSR underflow flag */

/********************  Bits definition for RTC_ALRABINR register  ******************/
#define RTC_ALRABINR_SS_Pos                 (0U)
#define RTC_ALRABINR_SS_Msk                 (0xFFFFFFFFUL << RTC_ALRABINR_SS_Pos)   /*!< 0xFFFFFFFF */
#define RTC_ALRABINR_SS                     RTC_ALRABINR_SS_Msk                     /*!< Synchronous counter alarm value in Binary mode */

/********************  Bits definition for RTC_ALRBBINR register  ******************/
#define RTC_ALRBBINR_SS_Pos                 (0U)
#define RTC_ALRBBINR_SS_Msk                 (0xFFFFFFFFUL << RTC_ALRBBINR_SS_Pos)   /*!< 0xFFFFFFFF */
#define RTC_ALRBBINR_SS                     RTC_ALRBBINR_SS_Msk                     /*!< Synchronous counter alarm value in Binary mode */

/* ****************************************************************************************************************** */
/*                                                                                                                    */
/*                                   System configuration, boot and security (SBS)                                    */
/*                                                                                                                    */
/* ****************************************************************************************************************** */
/* ************************************  Bit definition for SBS_HDPLCR register  ************************************ */
#define SBS_HDPLCR_INCR_HDPL_Pos               (0U)
#define SBS_HDPLCR_INCR_HDPL_Msk               (0xFFUL << SBS_HDPLCR_INCR_HDPL_Pos)                /*!< 0x000000FF */
#define SBS_HDPLCR_INCR_HDPL                   SBS_HDPLCR_INCR_HDPL_Msk                            /*!< HDPL value
                                                                                                        increment */

/* ************************************  Bit definition for SBS_HDPLSR register  ************************************ */
#define SBS_HDPLSR_HDPL_Pos                    (0U)
#define SBS_HDPLSR_HDPL_Msk                    (0xFFUL << SBS_HDPLSR_HDPL_Pos)                     /*!< 0x000000FF */
#define SBS_HDPLSR_HDPL                        SBS_HDPLSR_HDPL_Msk                                 /*!< Temporal
                                                                                                        isolation level
                                                                                                        */

/* *************************************  Bit definition for SBS_PMCR register  ************************************* */
#define SBS_PMCR_ADC1_IN2_REMAP_Pos            (0U)
#define SBS_PMCR_ADC1_IN2_REMAP_Msk            (0x1UL << SBS_PMCR_ADC1_IN2_REMAP_Pos)              /*!< 0x00000001 */
#define SBS_PMCR_ADC1_IN2_REMAP                SBS_PMCR_ADC1_IN2_REMAP_Msk                         /*!< ADC1 channel IN2
                                                                                                        remap */
#define SBS_PMCR_ADC1_IN5_REMAP_Pos            (1U)
#define SBS_PMCR_ADC1_IN5_REMAP_Msk            (0x1UL << SBS_PMCR_ADC1_IN5_REMAP_Pos)              /*!< 0x00000002 */
#define SBS_PMCR_ADC1_IN5_REMAP                SBS_PMCR_ADC1_IN5_REMAP_Msk                         /*!< ADC1 channel IN5
                                                                                                        remap */
#define SBS_PMCR_ADC1_IN6_REMAP_Pos            (2U)
#define SBS_PMCR_ADC1_IN6_REMAP_Msk            (0x1UL << SBS_PMCR_ADC1_IN6_REMAP_Pos)              /*!< 0x00000004 */
#define SBS_PMCR_ADC1_IN6_REMAP                SBS_PMCR_ADC1_IN6_REMAP_Msk                         /*!< ADC1 channel IN6
                                                                                                        remap */
#define SBS_PMCR_ADC1_IN7_REMAP_Pos            (3U)
#define SBS_PMCR_ADC1_IN7_REMAP_Msk            (0x1UL << SBS_PMCR_ADC1_IN7_REMAP_Pos)              /*!< 0x00000008 */
#define SBS_PMCR_ADC1_IN7_REMAP                SBS_PMCR_ADC1_IN7_REMAP_Msk                         /*!< ADC1 channel IN7
                                                                                                        remap */

