MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c532xx.h
/* ************************************  Bit definition for SBS_FPUIMR register  ************************************ */
#define SBS_FPUIMR_FPU_IE_Pos                  (0U)
#define SBS_FPUIMR_FPU_IE_Msk                  (0x3FUL << SBS_FPUIMR_FPU_IE_Pos)                   /*!< 0x0000003F */
#define SBS_FPUIMR_FPU_IE                      SBS_FPUIMR_FPU_IE_Msk                               /*!< FPU interrupt
                                                                                                        enable */
#define SBS_FPUIMR_FPU_IE_0                    (0x1UL << SBS_FPUIMR_FPU_IE_Pos)                    /*!< 0x00000001 */
#define SBS_FPUIMR_FPU_IE_1                    (0x2UL << SBS_FPUIMR_FPU_IE_Pos)                    /*!< 0x00000002 */
#define SBS_FPUIMR_FPU_IE_2                    (0x4UL << SBS_FPUIMR_FPU_IE_Pos)                    /*!< 0x00000004 */
#define SBS_FPUIMR_FPU_IE_3                    (0x8UL << SBS_FPUIMR_FPU_IE_Pos)                    /*!< 0x00000008 */
#define SBS_FPUIMR_FPU_IE_4                    (0x10UL << SBS_FPUIMR_FPU_IE_Pos)                   /*!< 0x00000010 */
#define SBS_FPUIMR_FPU_IE_5                    (0x20UL << SBS_FPUIMR_FPU_IE_Pos)                   /*!< 0x00000020 */

/* *************************************  Bit definition for SBS_MESR register  ************************************* */
#define SBS_MESR_MCLR_Pos                      (0U)
#define SBS_MESR_MCLR_Msk                      (0x1UL << SBS_MESR_MCLR_Pos)                        /*!< 0x00000001 */
#define SBS_MESR_MCLR                          SBS_MESR_MCLR_Msk                                   /*!< Device memories
                                                                                                        erase status */
#define SBS_MESR_IPMEE_Pos                     (16U)
#define SBS_MESR_IPMEE_Msk                     (0x1UL << SBS_MESR_IPMEE_Pos)                       /*!< 0x00010000 */
#define SBS_MESR_IPMEE                         SBS_MESR_IPMEE_Msk                                  /*!< ICACHE erase
                                                                                                        status */

/* ************************************  Bit definition for SBS_CCCSR register  ************************************* */
#define SBS_CCCSR_EN1_Pos                      (0U)
#define SBS_CCCSR_EN1_Msk                      (0x1UL << SBS_CCCSR_EN1_Pos)                        /*!< 0x00000001 */
#define SBS_CCCSR_EN1                          SBS_CCCSR_EN1_Msk                                   /*!< Enable
                                                                                                        compensation
                                                                                                        cell for VDDIO
                                                                                                        power rail */
#define SBS_CCCSR_CS1_Pos                      (1U)
#define SBS_CCCSR_CS1_Msk                      (0x1UL << SBS_CCCSR_CS1_Pos)                        /*!< 0x00000002 */
#define SBS_CCCSR_CS1                          SBS_CCCSR_CS1_Msk                                   /*!< Code selection
                                                                                                        for VDDIO power
                                                                                                        rail (reset
                                                                                                        value set to 1)
                                                                                                        */
#define SBS_CCCSR_RDY1_Pos                     (8U)
#define SBS_CCCSR_RDY1_Msk                     (0x1UL << SBS_CCCSR_RDY1_Pos)                       /*!< 0x00000100 */
#define SBS_CCCSR_RDY1                         SBS_CCCSR_RDY1_Msk                                  /*!< VDDIO
                                                                                                        compensation
                                                                                                        cell ready flag
                                                                                                        */

/* ************************************  Bit definition for SBS_CCVALR register  ************************************ */
#define SBS_CCVALR_ANSRC1_Pos                  (0U)
#define SBS_CCVALR_ANSRC1_Msk                  (0xFUL << SBS_CCVALR_ANSRC1_Pos)                    /*!< 0x0000000F */
#define SBS_CCVALR_ANSRC1                      SBS_CCVALR_ANSRC1_Msk                               /*!< Compensation
                                                                                                        value for the
                                                                                                        NMOS transistor
                                                                                                        */
#define SBS_CCVALR_APSRC1_Pos                  (4U)
#define SBS_CCVALR_APSRC1_Msk                  (0xFUL << SBS_CCVALR_APSRC1_Pos)                    /*!< 0x000000F0 */
#define SBS_CCVALR_APSRC1                      SBS_CCVALR_APSRC1_Msk                               /*!< Compensation
                                                                                                        value for the
                                                                                                        PMOS transistor
                                                                                                        */

/* ************************************  Bit definition for SBS_CCSWCR register  ************************************ */
#define SBS_CCSWCR_SW_ANSRC1_Pos               (0U)
#define SBS_CCSWCR_SW_ANSRC1_Msk               (0xFUL << SBS_CCSWCR_SW_ANSRC1_Pos)                 /*!< 0x0000000F */
#define SBS_CCSWCR_SW_ANSRC1                   SBS_CCSWCR_SW_ANSRC1_Msk                            /*!< NMOS
                                                                                                        compensation
                                                                                                        code for VDD
                                                                                                        power rails */
#define SBS_CCSWCR_SW_APSRC1_Pos               (4U)
#define SBS_CCSWCR_SW_APSRC1_Msk               (0xFUL << SBS_CCSWCR_SW_APSRC1_Pos)                 /*!< 0x000000F0 */
#define SBS_CCSWCR_SW_APSRC1                   SBS_CCSWCR_SW_APSRC1_Msk                            /*!< PMOS
                                                                                                        compensation
                                                                                                        code for the VDD
                                                                                                        power rails */

/* ************************************  Bit definition for SBS_CFGR2 register  ************************************* */
#define SBS_CFGR2_CLL_Pos                      (0U)
#define SBS_CFGR2_CLL_Msk                      (0x1UL << SBS_CFGR2_CLL_Pos)                        /*!< 0x00000001 */
#define SBS_CFGR2_CLL                          SBS_CFGR2_CLL_Msk                                   /*!< Core lockup lock
                                                                                                        */
#define SBS_CFGR2_SEL_Pos                      (1U)
#define SBS_CFGR2_SEL_Msk                      (0x1UL << SBS_CFGR2_SEL_Pos)                        /*!< 0x00000002 */
#define SBS_CFGR2_SEL                          SBS_CFGR2_SEL_Msk                                   /*!< SRAM ECC error
                                                                                                        lock */
#define SBS_CFGR2_PVDL_Pos                     (2U)
#define SBS_CFGR2_PVDL_Msk                     (0x1UL << SBS_CFGR2_PVDL_Pos)                       /*!< 0x00000004 */
#define SBS_CFGR2_PVDL                         SBS_CFGR2_PVDL_Msk                                  /*!< PVD lock */
#define SBS_CFGR2_ECCL_Pos                     (3U)
#define SBS_CFGR2_ECCL_Msk                     (0x1UL << SBS_CFGR2_ECCL_Pos)                       /*!< 0x00000008 */
#define SBS_CFGR2_ECCL                         SBS_CFGR2_ECCL_Msk                                  /*!< ECC lock */

/* ************************************  Bit definition for SBS_CLCKR register  ************************************* */
#define SBS_CLCKR_LOCKVTOR_Pos                 (0U)
#define SBS_CLCKR_LOCKVTOR_Msk                 (0x1UL << SBS_CLCKR_LOCKVTOR_Pos)                   /*!< 0x00000001 */
#define SBS_CLCKR_LOCKVTOR                     SBS_CLCKR_LOCKVTOR_Msk                              /*!< VTOR register
                                                                                                        lock */
#define SBS_CLCKR_LOCKMPU_Pos                  (1U)
#define SBS_CLCKR_LOCKMPU_Msk                  (0x1UL << SBS_CLCKR_LOCKMPU_Pos)                    /*!< 0x00000002 */
#define SBS_CLCKR_LOCKMPU                      SBS_CLCKR_LOCKMPU_Msk                               /*!< MPU register
                                                                                                        lock */

/* ***********************************  Bit definition for SBS_ECCNMIR register  ************************************ */
#define SBS_ECCNMIR_ECCNMI_MASK_EN_Pos         (0U)
#define SBS_ECCNMIR_ECCNMI_MASK_EN_Msk         (0x1UL << SBS_ECCNMIR_ECCNMI_MASK_EN_Pos)           /*!< 0x00000001 */
#define SBS_ECCNMIR_ECCNMI_MASK_EN             SBS_ECCNMIR_ECCNMI_MASK_EN_Msk                      /*!< NMI behavior
                                                                                                        setup when a
                                                                                                        double ECC error
                                                                                                        occurs on FLASH
                                                                                                        data part */

/******************************************************************************/
/*                                                                            */
/*                     Serial Peripheral Interface (SPI)                      */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for SPI_CR1 register  ********************/
#define SPI_CR1_SPE_Pos                     (0U)
#define SPI_CR1_SPE_Msk                     (0x1UL << SPI_CR1_SPE_Pos)              /*!< 0x00000001 */
#define SPI_CR1_SPE                         SPI_CR1_SPE_Msk                         /*!<Serial Peripheral Enable */
#define SPI_CR1_MASRX_Pos                   (8U)
#define SPI_CR1_MASRX_Msk                   (0x1UL << SPI_CR1_MASRX_Pos)            /*!< 0x00000100 */
#define SPI_CR1_MASRX                       SPI_CR1_MASRX_Msk                       /*!<Master automatic SUSP in Receive mode */
#define SPI_CR1_CSTART_Pos                  (9U)
#define SPI_CR1_CSTART_Msk                  (0x1UL << SPI_CR1_CSTART_Pos)           /*!< 0x00000200 */
#define SPI_CR1_CSTART                      SPI_CR1_CSTART_Msk                      /*!<Master transfer start  */
#define SPI_CR1_CSUSP_Pos                   (10U)
#define SPI_CR1_CSUSP_Msk                   (0x1UL << SPI_CR1_CSUSP_Pos)            /*!< 0x00000400 */
#define SPI_CR1_CSUSP                       SPI_CR1_CSUSP_Msk                       /*!<Master SUSPend request */
#define SPI_CR1_HDDIR_Pos                   (11U)
#define SPI_CR1_HDDIR_Msk                   (0x1UL << SPI_CR1_HDDIR_Pos)            /*!< 0x00000800 */
#define SPI_CR1_HDDIR                       SPI_CR1_HDDIR_Msk                       /*!<Rx/Tx direction at Half-duplex mode */
#define SPI_CR1_SSI_Pos                     (12U)
#define SPI_CR1_SSI_Msk                     (0x1UL << SPI_CR1_SSI_Pos)              /*!< 0x00001000 */
#define SPI_CR1_SSI                         SPI_CR1_SSI_Msk                         /*!<Internal SS signal input level */
#define SPI_CR1_CRC33_17_Pos                (13U)
#define SPI_CR1_CRC33_17_Msk                (0x1UL << SPI_CR1_CRC33_17_Pos)         /*!< 0x00002000 */
#define SPI_CR1_CRC33_17                    SPI_CR1_CRC33_17_Msk                    /*!<32-bit CRC polynomial configuration */
#define SPI_CR1_RCRCINI_Pos                 (14U)
#define SPI_CR1_RCRCINI_Msk                 (0x1UL << SPI_CR1_RCRCINI_Pos)          /*!< 0x00004000 */
#define SPI_CR1_RCRCINI                     SPI_CR1_RCRCINI_Msk                     /*!<CRC init pattern control for receiver */
#define SPI_CR1_TCRCINI_Pos                 (15U)
#define SPI_CR1_TCRCINI_Msk                 (0x1UL << SPI_CR1_TCRCINI_Pos)          /*!< 0x00008000 */
#define SPI_CR1_TCRCINI                     SPI_CR1_TCRCINI_Msk                     /*!<CRC init pattern control for transmitter */
#define SPI_CR1_IOLOCK_Pos                  (16U)
#define SPI_CR1_IOLOCK_Msk                  (0x1UL << SPI_CR1_IOLOCK_Pos)           /*!< 0x00010000 */
#define SPI_CR1_IOLOCK                      SPI_CR1_IOLOCK_Msk                      /*!<Locking the AF configuration of associated IOs */

