MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c532xx.h
/* *************************************  Bit definition for USB_FNR register  ************************************** */
#define USB_FNR_FN_Pos            (0U)
#define USB_FNR_FN_Msk            (0x7FFUL << USB_FNR_FN_Pos)            /*!< 0x000007FF */
#define USB_FNR_FN                USB_FNR_FN_Msk                         /*!< Frame number */
#define USB_FNR_LSOF_Pos          (11U)
#define USB_FNR_LSOF_Msk          (0x3UL << USB_FNR_LSOF_Pos)            /*!< 0x00001800 */
#define USB_FNR_LSOF              USB_FNR_LSOF_Msk                       /*!< Lost SOF */
#define USB_FNR_LCK_Pos           (13U)
#define USB_FNR_LCK_Msk           (0x1UL << USB_FNR_LCK_Pos)             /*!< 0x00002000 */
#define USB_FNR_LCK               USB_FNR_LCK_Msk                        /*!< Locked */
#define USB_FNR_RXDM_Pos          (14U)
#define USB_FNR_RXDM_Msk          (0x1UL << USB_FNR_RXDM_Pos)            /*!< 0x00004000 */
#define USB_FNR_RXDM              USB_FNR_RXDM_Msk                       /*!< Receive data - line status */
#define USB_FNR_RXDP_Pos          (15U)
#define USB_FNR_RXDP_Msk          (0x1UL << USB_FNR_RXDP_Pos)            /*!< 0x00008000 */
#define USB_FNR_RXDP              USB_FNR_RXDP_Msk                       /*!< Receive data + line status */

/* ************************************  Bit definition for USB_DADDR register  ************************************* */
#define USB_DADDR_ADD_Pos         (0U)
#define USB_DADDR_ADD_Msk         (0x7FUL << USB_DADDR_ADD_Pos)          /*!< 0x0000007F */
#define USB_DADDR_ADD             USB_DADDR_ADD_Msk                      /*!< Device address */
#define USB_DADDR_EF_Pos          (7U)
#define USB_DADDR_EF_Msk          (0x1UL << USB_DADDR_EF_Pos)            /*!< 0x00000080 */
#define USB_DADDR_EF              USB_DADDR_EF_Msk                       /*!< Enable function */

/* ************************************  Bit definition for USB_LPMCSR register  ************************************ */
#define USB_LPMCSR_LPMEN_Pos      (0U)
#define USB_LPMCSR_LPMEN_Msk      (0x1UL << USB_LPMCSR_LPMEN_Pos)        /*!< 0x00000001 */
#define USB_LPMCSR_LPMEN          USB_LPMCSR_LPMEN_Msk                   /*!< LPM support enable */
#define USB_LPMCSR_LPMACK_Pos     (1U)
#define USB_LPMCSR_LPMACK_Msk     (0x1UL << USB_LPMCSR_LPMACK_Pos)       /*!< 0x00000002 */
#define USB_LPMCSR_LPMACK         USB_LPMCSR_LPMACK_Msk                  /*!< LPM token acknowledge enable */
#define USB_LPMCSR_REMWAKE_Pos    (3U)
#define USB_LPMCSR_REMWAKE_Msk    (0x1UL << USB_LPMCSR_REMWAKE_Pos)      /*!< 0x00000008 */
#define USB_LPMCSR_REMWAKE        USB_LPMCSR_REMWAKE_Msk                 /*!< bRemoteWake value */
#define USB_LPMCSR_BESL_Pos       (4U)
#define USB_LPMCSR_BESL_Msk       (0xFUL << USB_LPMCSR_BESL_Pos)         /*!< 0x000000F0 */
#define USB_LPMCSR_BESL           USB_LPMCSR_BESL_Msk                    /*!< BESL value */

/* *************************************  Bit definition for USB_BCDR register  ************************************* */
#define USB_BCDR_BCDEN_Pos        (0U)
#define USB_BCDR_BCDEN_Msk        (0x1UL << USB_BCDR_BCDEN_Pos)          /*!< 0x00000001 */
#define USB_BCDR_BCDEN            USB_BCDR_BCDEN_Msk                     /*!< Battery charging detector (BCD) enable */
#define USB_BCDR_DCDEN_Pos        (1U)
#define USB_BCDR_DCDEN_Msk        (0x1UL << USB_BCDR_DCDEN_Pos)          /*!< 0x00000002 */
#define USB_BCDR_DCDEN            USB_BCDR_DCDEN_Msk                     /*!< Data contact detection (DCD) mode enable
                                                                              */
#define USB_BCDR_PDEN_Pos         (2U)
#define USB_BCDR_PDEN_Msk         (0x1UL << USB_BCDR_PDEN_Pos)           /*!< 0x00000004 */
#define USB_BCDR_PDEN             USB_BCDR_PDEN_Msk                      /*!< Primary detection (PD) mode enable */
#define USB_BCDR_SDEN_Pos         (3U)
#define USB_BCDR_SDEN_Msk         (0x1UL << USB_BCDR_SDEN_Pos)           /*!< 0x00000008 */
#define USB_BCDR_SDEN             USB_BCDR_SDEN_Msk                      /*!< Secondary detection (SD) mode enable */
#define USB_BCDR_DCDET_Pos        (4U)
#define USB_BCDR_DCDET_Msk        (0x1UL << USB_BCDR_DCDET_Pos)          /*!< 0x00000010 */
#define USB_BCDR_DCDET            USB_BCDR_DCDET_Msk                     /*!< Data contact detection (DCD) status */
#define USB_BCDR_PDET_Pos         (5U)
#define USB_BCDR_PDET_Msk         (0x1UL << USB_BCDR_PDET_Pos)           /*!< 0x00000020 */
#define USB_BCDR_PDET             USB_BCDR_PDET_Msk                      /*!< Primary detection (PD) status */
#define USB_BCDR_SDET_Pos         (6U)
#define USB_BCDR_SDET_Msk         (0x1UL << USB_BCDR_SDET_Pos)           /*!< 0x00000040 */
#define USB_BCDR_SDET             USB_BCDR_SDET_Msk                      /*!< Secondary detection (SD) status */
#define USB_BCDR_PS2DET_Pos       (7U)
#define USB_BCDR_PS2DET_Msk       (0x1UL << USB_BCDR_PS2DET_Pos)         /*!< 0x00000080 */
#define USB_BCDR_PS2DET           USB_BCDR_PS2DET_Msk                    /*!< DM pull-up detection status */
#define USB_BCDR_DPPU_DPD_Pos     (15U)
#define USB_BCDR_DPPU_DPD_Msk     (0x1UL << USB_BCDR_DPPU_DPD_Pos)       /*!< 0x00008000 */
#define USB_BCDR_DPPU_DPD         USB_BCDR_DPPU_DPD_Msk                  /*!< DP pull-up / DPDM pull-down */


/* EndPoint Register MASK (no toggle fields) */
#define USB_CHEP_REG_MASK                          (USB_CHEP_ERR_RX | USB_CHEP_ERR_TX | USB_CHEP_LS_EP | \
                                                    USB_CHEP_DEVADDR | USB_CHEP_VTRX | USB_CHEP_SETUP | \
                                                    USB_CHEP_UTYPE | USB_CHEP_EPKIND | USB_CHEP_VTTX | USB_CHEP_EA | \
                                                    USB_CHEP_NAK) /* 0x07FF8F8F */

#define USB_CHEP_TX_DTOGMASK                       (USB_CHEP_STATTX | USB_CHEP_REG_MASK)
#define USB_CHEP_RX_DTOGMASK                       (USB_CHEP_STATRX | USB_CHEP_REG_MASK)

#define USB_CHEP_TX_DTOG1                          (0x00000010UL)           /*!< Channel/EndPoint TX Data Toggle bit1 */
#define USB_CHEP_TX_DTOG2                          (0x00000020UL)           /*!< Channel/EndPoint TX Data Toggle bit2 */
#define USB_CHEP_RX_DTOG1                          (0x00001000UL)           /*!< Channel/EndPoint RX Data Toggle bit1 */
#define USB_CHEP_RX_DTOG2                          (0x00002000UL)           /*!< Channel/EndPoint RX Data Toggle bit2 */

/*!< EP_TYPE[1:0] Channel/EndPoint TYPE */
#define USB_EP_TYPE_MASK                           (0x00000600UL)           /*!< Channel/EndPoint TYPE Mask */
#define USB_EP_BULK                                (0x00000000UL)           /*!< Channel/EndPoint BULK */
#define USB_EP_CONTROL                             (0x00000200UL)           /*!< Channel/EndPoint CONTROL */
#define USB_EP_ISOCHRONOUS                         (0x00000400UL)           /*!< Channel/EndPoint ISOCHRONOUS */
#define USB_EP_INTERRUPT                           (0x00000600UL)           /*!< Channel/EndPoint INTERRUPT */

#define USB_EP_T_MASK                              ((~USB_EP_UTYPE) & USB_CHEP_REG_MASK) /* =0x898F */
#define USB_CH_T_MASK                              ((~USB_CH_UTYPE) & USB_CHEP_REG_MASK) /* =0x898F */

#define USB_EP_KIND_MASK                           ((~USB_EP_EPKIND) & USB_CHEP_REG_MASK) /*!< EP_KIND EndPoint KIND */
#define USB_CH_KIND_MASK                           ((~USB_CH_EPKIND) & USB_CHEP_REG_MASK) /*!< EP_KIND EndPoint KIND */

