MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c532xx.h
/*******************  Bit definition for WWDG_CFR register  *******************/
#define WWDG_CFR_W_Pos                      (0U)
#define WWDG_CFR_W_Msk                      (0x7FUL << WWDG_CFR_W_Pos)              /*!< 0x0000007F */
#define WWDG_CFR_W                          WWDG_CFR_W_Msk                          /*!<W[6:0] bits (7-bit window value) */
#define WWDG_CFR_W_0                        (0x01UL << WWDG_CFR_W_Pos)              /*!< 0x00000001 */
#define WWDG_CFR_W_1                        (0x02UL << WWDG_CFR_W_Pos)              /*!< 0x00000002 */
#define WWDG_CFR_W_2                        (0x04UL << WWDG_CFR_W_Pos)              /*!< 0x00000004 */
#define WWDG_CFR_W_3                        (0x08UL << WWDG_CFR_W_Pos)              /*!< 0x00000008 */
#define WWDG_CFR_W_4                        (0x10UL << WWDG_CFR_W_Pos)              /*!< 0x00000010 */
#define WWDG_CFR_W_5                        (0x20UL << WWDG_CFR_W_Pos)              /*!< 0x00000020 */
#define WWDG_CFR_W_6                        (0x40UL << WWDG_CFR_W_Pos)              /*!< 0x00000040 */
#define WWDG_CFR_WDGTB_Pos                  (11U)
#define WWDG_CFR_WDGTB_Msk                  (0x7UL << WWDG_CFR_WDGTB_Pos)           /*!< 0x00003800 */
#define WWDG_CFR_WDGTB                      WWDG_CFR_WDGTB_Msk                      /*!<WDGTB[2:0] bits (Timer Base) */
#define WWDG_CFR_WDGTB_0                    (0x1UL << WWDG_CFR_WDGTB_Pos)           /*!< 0x00000800 */
#define WWDG_CFR_WDGTB_1                    (0x2UL << WWDG_CFR_WDGTB_Pos)           /*!< 0x00001000 */
#define WWDG_CFR_WDGTB_2                    (0x4UL << WWDG_CFR_WDGTB_Pos)           /*!< 0x00002000 */
#define WWDG_CFR_EWI_Pos                    (9U)
#define WWDG_CFR_EWI_Msk                    (0x1UL << WWDG_CFR_EWI_Pos)             /*!< 0x00000200 */
#define WWDG_CFR_EWI                        WWDG_CFR_EWI_Msk                        /*!<Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_SR register  ********************/
#define WWDG_SR_EWIF_Pos                    (0U)
#define WWDG_SR_EWIF_Msk                    (0x1UL << WWDG_SR_EWIF_Pos)             /*!< 0x00000001 */
#define WWDG_SR_EWIF                        WWDG_SR_EWIF_Msk                        /*!<Early Wakeup Interrupt Flag */


/** @addtogroup STM32C5xx_Peripheral_Exported_macros
  * @{
  */


/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

#define IS_ADC_COMMON_INSTANCE(INSTANCE) ((INSTANCE) == ADC12_COMMON)

/* Select the ADC common instance to which belongs the selected ADC instance */
#define ADC_COMMON_INSTANCE(adc_instance) (ADC12_COMMON)

/* Select the ADC multimode instance master corresponding to the selected ADC instance */
#define ADC_MULTI_INSTANCE_MASTER(adc_instance) (((adc_instance) == ADC2) ? (ADC1) : (adc_instance))

/******************************* COMP Instances *******************************/
#define IS_COMP_ALL_INSTANCE(INSTANCE) (((INSTANCE) == COMP1) || ((INSTANCE) == COMP2))

/****************************** CORDIC Instances ******************************/
#define IS_CORDIC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CORDIC)

/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRC)

/******************************* CRS Instances ********************************/
#define IS_CRS_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRS)

/*************************************** DAC Instances *******************************/
#define IS_DAC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DAC1)

/******************************** DMA Instances *******************************/
#define IS_DMA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == LPDMA1_CH0)  || \
                                       ((INSTANCE) == LPDMA1_CH1)  || \
                                       ((INSTANCE) == LPDMA1_CH2)  || \
                                       ((INSTANCE) == LPDMA1_CH3)  || \
                                       ((INSTANCE) == LPDMA2_CH0)  || \
                                       ((INSTANCE) == LPDMA2_CH1)  || \
                                       ((INSTANCE) == LPDMA2_CH2)  || \
                                       ((INSTANCE) == LPDMA2_CH3))

#define IS_LPDMA1_INSTANCE(INSTANCE)   (((INSTANCE) == LPDMA1_CH0)  || \
                                        ((INSTANCE) == LPDMA1_CH1)  || \
                                        ((INSTANCE) == LPDMA1_CH2)  || \
                                        ((INSTANCE) == LPDMA1_CH3))

#define IS_LPDMA2_INSTANCE(INSTANCE)   (((INSTANCE) == LPDMA2_CH0)  || \
                                        ((INSTANCE) == LPDMA2_CH1)  || \
                                        ((INSTANCE) == LPDMA2_CH2)  || \
                                        ((INSTANCE) == LPDMA2_CH3))

#define IS_DMA_PFREQ_INSTANCE(INSTANCE)   (((INSTANCE) == LPDMA1_CH0)  || \
                                           ((INSTANCE) == LPDMA1_CH3)  || \
                                           ((INSTANCE) == LPDMA2_CH0)  || \
                                           ((INSTANCE) == LPDMA2_CH3))

/* ************************************************* FLASH Instances ************************************************ */
#define IS_FLASH_INSTANCE(INSTANCE)    (((INSTANCE) == FLASH))

/* ************************************************* FDCAN Instances ************************************************ */
#define IS_FDCAN_ALL_INSTANCE(INSTANCE) (((INSTANCE) == FDCAN1)    \
                                         || ((INSTANCE) == FDCAN2))

#define FDCAN_MULTI_INSTANCE_CONFIG(INSTANCE) (IS_FDCAN_ALL_INSTANCE(INSTANCE) ? \
                                               (FDCAN_CONFIG) : (NULL))


/* ************************************************* GPIO Instances ************************************************* */
#define IS_GPIO_ALL_INSTANCE(INSTANCE) (((INSTANCE) == GPIOA)     \
                                        || ((INSTANCE) == GPIOB)  \
                                        || ((INSTANCE) == GPIOC)  \
                                        || ((INSTANCE) == GPIOD)  \
                                        || ((INSTANCE) == GPIOE)  \
                                        || ((INSTANCE) == GPIOH))

